{
    "id": "181590750932",
    "state": "published",
    "timestamp": 1546287114,
    "date_iso": "2018-12-31T15:11:54-05:00",
    "title": "2018 Annual Review",
    "permalink": "https://vael.tumblr.com/post/181590750932/2018-annual-review",
    "tags": [
        "annual review"
    ],
    "type": "text",
    "body_html": "<p>Another year in the books and I&rsquo;ll be using <a href=\"https://jamesclear.com/2017-annual-review\" target=\"_blank\">James Clear&rsquo;s review format</a> as inspiration for my own Annual Reviews. This year was a busy one for me, but unfortunately not my best.</p><h2>What went well this year? </h2><p><b>I released Bean Grower.</b> It was well received! A few people stuck around after the tutorial and two people played far more than I had expected. (one of them my wife, who played more than just for that sake) Bean Grower is designed as a supplemental game for the studio, which means it is not a main driver for profit or success and that it can&rsquo;t be played continuously. Its purpose is to be a warm-up or even cool-down game after playing one of the studio&rsquo;s main titles. </p><p>This was my first ever truly completed game; MonBre was never finished. I learned a lot about game design, web game design, and built out my developer toolkit. After Orbium, I found some time to give the game a <a href=\"https://tinydark.com/blog/bean-grower-version-11\" target=\"_blank\">small update</a>.</p><p><b>I refactored and released The Orbium.</b> I learned a technology known as React.js for this, and the results were impressive: the site is snappy, easy to maintain, and fun to develop. I made the Game Feed, what is effectively a &ldquo;Facebook Timeline&rdquo; but for what you and your friends are doing in games. We now adhere to the GDPR, and we no longer even require an email to sign up. It&rsquo;s now a Progressive Web App, which means it&rsquo;s installable on your phone and hopefully soon will be available in app stores. (the web world is waiting for companies to make that decision) </p><p><b>I started building a house.</b> Two years ago, my boss pitched the idea of moving the company to South Carolina. My wife and I had a lot of trouble finding a house we loved, so I met with a builder in February 2018 to start the process of building our dream home. I&rsquo;m extremely happy with the floor plan, and the house sits on a happy 2.13 acres. We expect to garden/farm the land starting this Summer. We&rsquo;re currently waiting for it to finish; more on that in the next section. </p><p><b>I changed my name.</b> Finally, after months of emails, mails, phone calls and two court appearances, my family has adopted the surname Victus. I&rsquo;m done being someone I&rsquo;m not. \n\n</p><p><b>I organized myself.</b> I spent a solid two weeks doing all manner of things to organize myself, spawned from the realization that I&rsquo;d lose some important files that should have been on a dropbox. (and now are) I organized my bookmarks, files, Asana to-do lists, switched from Simplenote to OneNote, and even washed and organized my messenger bag. </p><h2>What didn’t go so well this year?</h2><p><b>Mental performance.</b> This has been the worst year for my mental performance and health since 2009-10&rsquo;s depression. I used to be an information sponge. I used to speak better and feel more in control. I could articulate my thoughts better. I don’t even like how I’ve written this annual review. I added maybe two files to my dropbox&rsquo;s &ldquo;Mind Palace&rdquo; directory this year; it has been my worst year for learning, partly because I felt like what I was learning was turning to mush. I tackled cell phone usage and maybe that helped, but <a href=\"https://vael.tumblr.com/post/178466108057/forest\" target=\"_blank\">Forest </a>can only take me so far.</p><p>I don&rsquo;t know what it was that triggered me into this state, but I can say it was around mid-January that I started to feel sluggish. I&rsquo;ve reclaimed short windows of lucidity here and there, but the bottom line is that I felt very average this year and I refuse to believe that it&rsquo;s age. I have reason to believe it&rsquo;s partially hereditary. </p><p>Regarding my mental <i>health:</i> I&rsquo;m a fairly stable, low-<a href=\"https://en.wikipedia.org/wiki/Big_Five_personality_traits\" target=\"_blank\">neuroticism </a>guy. But this year I felt more prone to anger and apathy. I think, ultimately, I had a lot of moving pieces: changing my name, building a house, learning new tech and working on my hobby work whenever possible, financial concerns regarding the house, and still trying to maintain a happy family. </p><p><b>Extended Family.</b> Now that it&rsquo;s happened, I realize how inevitable it was. We&rsquo;ve always been the black sheep and my wife was never fully accepted into the family. I&rsquo;m not detailing the past eight years of familial interactions here, but after years of passive-aggressive quips at parties, being excluded from group-texts and such, it all went down in an MMS soon after Thanksgiving. Everyone was free to speak their minds being that we&rsquo;re moving to South Carolina. I decided to stop coming around, which does not bother anyone except my immediate family. Where I once thought we&rsquo;d at least fly up bi-annually, now I have no plans to return other than for a vacation. I will fly up solo for funerals.</p><p><b>The house. </b>So we have this beautiful life laid out for us, really going to do things right, breathe clean air and finally have a place to put things, it&rsquo;ll be grand. The builder says 4-6 months; we assume once the financing begins that it&rsquo;ll be more like 6-7 months, and everyone we talked to said it would probably be the case. We figured October at the latest, maybe fully settled by end of November. It&rsquo;s looking more like 9+ months now. The house was 71% done (an actual metric) on the 19th of December. We&rsquo;re confident we&rsquo;ll be moving in January, but there is no guarantee, and this has made things very stressful for us. The builder’s reason for taking so long is the weather. Google suggests it’s been a very rainy season for them, so it’s probably true.</p><p>When building a house, you&rsquo;ll have a monthly escrow payment relative to the amount the builder&rsquo;s taken out of the loan in order to actually build the house. This is an interest payment and while it is tax-deductible, $3,500 has been sucked out of my bank account. Each month that goes by gets higher and higher, meaning each month we&rsquo;re delayed hurts more and more. The money is just thrown away to the bank. Escrow + down payment + saving for the move has been stressful to manage.</p><h2>What did I learn? </h2><p>I became a better web and game developer this year. </p><p>I think I finally learned to stop playing <a href=\"https://play.google.com/store/apps/details?id=com.qcplay.slimegogogo&amp;hl=en_US\" target=\"_blank\">a game</a> when it becomes a chore. </p><p>Most people&rsquo;s work and hobbies aren&rsquo;t going to meaningfully progress humanity, so all that really matters in the end is how many children we have and how well we take care of them.</p><p>I learned the value of thoughtfulness when a surprise birthday gift from a friend coincided with my wife returning from her trip; we had a few long talk-fights about how husbands should be, and I have to say I feel great giving her surprises and going out of my way for her. Will try to be more thoughtful with friends and everyone around me. </p><p>Changing your name is a pain. Changing it while building a house is just asking for more pain. </p><p>Familial relationships are less durable than I&rsquo;d thought. Also considering technology&rsquo;s role in all this.</p><h2>2019 Outlook </h2><p><b>Sunny!</b> I hope it will be my best year yet. I&rsquo;m a very goal-driven person, so this house is huge for me. Because of the the security and happiness a house offers, saving has been a priority for me ever since I took my current job in Summer 2012. Every lazy takeout dinner or car maintenance bill has been a direct assault on that goal; that is how I think, and most people find it a miserable way to live, but here I am. It&rsquo;s a great weight lifted. </p><p><b>I&rsquo;m going to release Fireburner this year.</b> I think I’ve come up with a way for the game to be fun. I hope to surpass Bean Grower in visual quality/polish. It isn’t a game for everyone, however, and while it isn’t a supplemental game for the studio, it also isn’t a main driver.</p><p><b>GAM3 will be totally ready for external developers. </b>I should not keep the engine to myself.<b> </b>I want people building with it. I want to monetize it. </p><p>I eventually want to approach companies to demo GAM3 as a real tool for building web games and even apps! My work with app-ifying The Orbium means it should be trivial to get that working for GAM3; the implications of such being that anyone who makes a GAM3 game also makes an Android or iOS app. That&rsquo;s powerful stuff. </p><p>In order to do this, GAM3&rsquo;s player side is getting the same refactoring that Orbium did. I&rsquo;m going to take a break to tech up before I do this, as it&rsquo;s imperative that I do it right the first time. This means I won&rsquo;t be as focused on &ldquo;results&rdquo; this year, but it also means I&rsquo;ll spend a lot less time building each game&rsquo;s tech in the future. </p><p><b>Zen.</b> I&rsquo;m making an effort to heal and refine myself. I want a lucid mind and flexible body. It&rsquo;s time to take my sleep seriously. It&rsquo;s time to properly manage my dry-eye. My son&rsquo;s (assumed) bus schedule means that I&rsquo;m going to have more time to myself in the morning before work, so I&rsquo;ll be starting the day off by stretching and making myself a real breakfast at least 3/5 weekdays. I want to be my best, and it&rsquo;s going to start with this effort. </p><p>Thanks for reading my annual review! Here’s to hoping 2020 will be even sunnier. :}</p>",
    "summary_html": "2018 Annual Review",
    "photos": []
}