{
    "id": "187341440887",
    "state": "published",
    "timestamp": 1567044074,
    "date_iso": "2019-08-28T22:01:14-04:00",
    "title": "Die2nite Teardown",
    "permalink": "https://vael.tumblr.com/post/187341440887/die2nite-teardown",
    "tags": [
        "die2nite",
        "vaelvict.us"
    ],
    "type": "text",
    "body_html": "<p><i>\n\nEstimated reading time: <b>15 minutes, 3 seconds</b>.<br/>Experienced players should skip to the Ethics section. From there, estimated time: <b>9 minutes, 4 seconds</b>.</i></p><p>A\nteardown is a document that dismantles a competing company, service,\nor product with the goal of informing business decisions. My business\nis Tinydark, a microstudio that produces ethical, experimental indie\ngames. Today I’ll be tearing down a game known as Die2nite, a game\nreleased in December 2010 by Motion Twin. Prior to this release was\nthe French-language version known as Hordes, released on July 2008.</p><h2>Overview</h2><p>It&rsquo;s\nthe zombie apocalypse.</p><p><b>\n</b></p><p>A\ntown is randomly generated and players are assigned to it with the\ngoal of surviving as long as possible. The game begins once 40\nplayers have entered. Each player will play a self-determined role\nfor the survival of the town: some will scavenge outside of town,\nothers will construct buildings, and brave souls will risk their\nlives camping overnight in the World Beyond for a copy of a\nbuilding&rsquo;s blueprint. These player decisions are enacted using AP:\nAction Points, which are given at the start of each new Day and are\nreplenished through food, water, alcohol and drugs.</p><p><b>The\nAttack</b></p><p>At\nmidnight, the zombie horde attacks. Defense is up to players inside\nthe town walls. Some will stand on the battlements as Watchmen,\nrisking their lives and inventory to personally defend the town,\nwhile others cower in their homes. Defense is simple: 1 Zombie eats 1\nDefense. Any zombies over Defense enter the town and terrorize the\ncitizens, leaving personal survival up to luck and the citizen&rsquo;s Home\nDefense. When the attack is over, the loop begins again, with a\ngreater number of zombies in the next wave.</p><p><b>The\nWorld Beyond</b></p><p>Leaving\nthe town presents the player with a grid and coordinate-based  system\nof travel. Taking a step in any direction will cost 1 AP, meaning\neach step costs a total of 2 AP if they plan to make a return trip.\nOnce on a new tile (or &ldquo;square&rdquo;, &ldquo;coordinate&rdquo;),\nthe player is given the ability to scavenge or camp. Players have\nlimited inventory spots to hold supplies and scavenged items.</p><figure data-orig-width=\"932\" data-orig-height=\"578\" class=\"tmblr-full\"><img src=\"https://64.media.tumblr.com/3dfc67e3cf69f3cbbccd972444b065ef/74cb707143591920-12/s540x810/80c1de78e0e3bcdc2dc72a0e4fb8f44da174eca2.png\" alt=\"image\" data-orig-width=\"932\" data-orig-height=\"578\"/></figure><p>Scavenging\nwill immediately search to find an item, and then start a two-hour\ntimer to continue searching while the player sits on the tile. The player will autosearch while offline, with the responsibility\nthat they must return to town before the gates close. Zones eventually become permanently depleted and return only scrap\nmaterials. Scavengers and the loot they return with are critical to\nthe success of a town and it is a thrilling, if not dangerous, role.</p><p>Camping\nallows the player to survive one night in the World Beyond, enabling\nfarther trips and rewarding a scavenging bonus the next day. When a\nplayer finds a good spot, they can spend AP to improve the area and\ncamp out there. There is a risk of death that scales on how far you\nare from the town, and only Survivalist heroes can max out at 100%\nsafety.</p><p>Every move to a tile presents\na risk of being outnumbered, and immediately trapped, by zombies. In\nthat case you can either wait for help, try a hard luck challenge to\nkill one with your bare hands, or escape but leave with an injury.\nFor this reason, it&rsquo;s best to travel in groups, which can be difficult\nin PUG towns.</p><p>Finally,\nbuildings known as <b>ruins</b> exist in the World Beyond.\nCampers often only camp in ruins, which provide protection and reward\na blueprint when finished. Blueprints are used to unlock buildings in\ntown. Examples of ruins include an abandoned bunker, cave, destroyed\npharmacy, and a restaurant. \n</p><p><b><a href=\"http://d2nwiki.com/wiki/Hero\" target=\"_blank\">Heroes</a></b></p><p>Heroes\nare premium (cash) players. Being a hero costs $11.50 for 31 Days at\nthe time of writing. The 200 Day pack costs $69 and rewards a very\nuseful item. Days only tick down when you actually play a day\nin-game.</p><p>Being\na hero allows the player to choose one of six classes:</p><ul><li>\n\n<b>Scavengers</b> find many more items when searching in the World Beyond.\n\n\n\t</li><li>\n\n<b>Scouts</b> can go through zones with zombies in them undetected.\n\n\n\t</li><li>\n\n<b>Guardians</b> have more control points in a zone and contribute defense to a town just by being inside the gates at night.\n\n\n\t</li><li>\n\n<b>Tamers</b> can use their dog to send objects back to town while in the World Beyond, effectively doubling their inventory size. Their dog provides a little more defense when acting as a Watchman.\n\n\n\t</li><li>\n\n<b>Technicians</b> have an additional action bank: Construction Points, used to construct buildings.\n\n\n\t</li><li>\n\n<b>Survivalists</b> are able to find food <i>or</i> water in the desert once per day, and are capable of having a 100% camping success rate.</li></ul><p>In\naddition, Heroes unlock skills the more time they spend as Heroes. Some of these are very powerful and give incentive to\nkeep paying the Hero subscription: it really sucks to lose these\nabilities when you run out of Days.</p><p>It\nis possible to earn Hero Days without payment. The <b>Last\nMan Standing</b>\nin a town will receive free Hero Days based on how long the town\nsurvived. Only one person can receive this; this incentivizes\nselfish play, meaning the undead are not always your biggest threat.\nIt could be poisoned food, you may be locked out of town, or perhaps\neven eaten by a half-zombie player.<br/><br/>One\nmust work toward both the survival of the town and the preservation\nof one&rsquo;s self to receive an abundance of soul points and hero days.</p><h2>Game\nLoop</h2><p>Each\nday, the player will log in and spend their AP. 6 are\navailable by default, and a player can receive 6-8 AP from <b>food</b>,\n<b>water</b>,\n<b>alcohol,\n</b>and\n<b>drugs</b>,\ngiving a max of 30-33 AP. (at least without drug addiction) These can\nbe spent as follows:</p><ul><li>\n\nDirectly building constructions\n\n\n\t</li><li>\n\nConverting materials\n\n\n\t</li><li>\n\nRepairing items\n\n\n\t</li><li>\n\nMoving around the World Beyond to scavenge\n\n\n\t</li><li>\n\nMisc. uses, such as Guardians spending 1 AP to temporarily increase town Defense through the guard tower</li></ul><p>As\n40 people spend their AP, each player&rsquo;s personal agency improves the\ntown&rsquo;s chance of survival. It is critical to have diverse roles in\nthe community: scavengers bring in materials.\nBuildings won&rsquo;t be built without builders. Advanced blueprints won&rsquo;t\nbe found without campers. Players often take on multiple roles during\na town&rsquo;s lifespan.</p><h2>Other\nElements</h2><p>Die2nite&rsquo;s\na complex game. A few other notables:</p><ul><li>Water supplies can be sparse, but it is both essential to life and a powerful weapon vs. zombies: they absolutely disintegrate at the touch of it.<br/></li><li>\n\nThe Shaman is a democratically elected role which allows a player to work with the souls of the dead; a sort of recompense for losing fellow citizens. They can summon rain to fill water reserves.\n\n\n\t</li><li>\n\nGhouls are players who&rsquo;ve engaged in cannibalism \n\n—\n\n eating players&rsquo; remains or certain rare items \n\n—\n\n and come out of it half-zombie. They can devour one citizen per day and will be awarded a Hero Day for each. A single punch from a citizen will kill the ghoul.</li><li>\n\nDrinking alcohol results in nonsensical speech on the forums, and items sent through the mail will sometimes end up at the wrong person. Similarly, becoming Terrified during the night attack will cause one&rsquo;s speech to become erratic, and head injuries result in slurred speech. Sadly, these can all be circumvented through posting the same message multiple times.\n\n\n\t</li><li>\n\nDistinctions are a huge part of D2N culture. They&rsquo;re effectively achievements and they award titles once you&rsquo;ve done something enough times. They can affect player behavior and sometimes communities will raffle off the ability to build a certain item for a distinction.</li></ul><h2>Ethics</h2><p>Die2nite’s core engagement and monetization are unethical.</p><p><b>Realtime\nDedication</b></p><p>The\nmost egregious offense is baked directly into the game&rsquo;s core.\nBecause so much of the game is dependent on realtime interaction,\noptimal play requires that the player is engaged throughout the day.\nThe best players will log in as soon after the attack as possible so\nthat they may begin their duties.</p><p>Scavenging\nis the most problematic. Since areas deplete after so many searches,\nand it is never known to any player how many searches are left, you\ncould set your character to search overnight but deplete at the first\ntick. The player implicitly understands this and may check in\nthroughout the day, or even night.</p><p>If\nin the World Beyond, the player has to manage when to return to the\ntown. This is usually an hour before attack so as to maximize\nefficiency. If they don&rsquo;t make it, it&rsquo;s instant\ndeath and they earn no distinctions for that Day. Navigation in the\nWorld Beyond is Flash-based and the the player must be at a PC, or\ntechnically apt enough to get it running on the phone, in order to move.</p><p>Things\nare quieter in town, but someone still must close the gate. As the\npopulation dwindles, fewer people are available for this critical\ntask, meaning those who are less able to do it are forced to check\nin, or die. Organized play usually makes gate-closing a trivial task,\nbut the point stands: when you require players to check in at a\ncertain hour, they could be anywhere and it could be any time.\nIn-law&rsquo;s for Christmas, birthday party on the weekend, engaging in an\nactivity in which they simply cannot use a device for a while.</p><p>More\nthan a few times I have inconvenienced my real life just to return to\nthe game. Add into it the guilt of letting your town down, and the\nsimple act of returning can be more than a chore, but also a matter of duty.\nPlayers often set alarms to remind them to return. It is only\nunethical games that punish players for not logging in. (&ldquo;your\ncastle will be destroyed in 15 minutes&rdquo;) A push notification for\na potentially missed opportunity, such as capitalizing on a temporary\n2x resource bonus, is <i>not</i>\nunethical engagement.</p><p><b>Pay\n2 Win</b></p><p>Heroes\nare very powerful. One could argue they should be \n\n—\n\n the game would\nnot exist without them \n\n—\n\n but the power disparity is far too great.\nReturning to resident class after six months of being a hero was so\nhard that I ended up quitting; one becomes accustomed to being an\nall-powerful sentinel. The moment I quit was when I was trapped by\nzombies in a zone and reached for an escape-hatch item that I&rsquo;d earned by\nspending $60 in Hero Days. When I went to use it, I learned I had to become a hero again, and the game even taunted me about it.</p><blockquote><p>While we strive for self-sustainment, it will not be achieved by intentionally dooming the player and offering them a life-saving resource for real money.<br/>\n\n—\n\n <a href=\"https://tinydark.com/pillars\" target=\"_blank\">tinydark monetization pillar</a></p></blockquote><p>Heroes\nare just as eligible for earning Hero Days as residents are by being\nthe last survivor in a town, but with an added bonus: they get extra\npersonal defense, they get easy access to certain items, and even a\nway to avoid death that they might otherwise have suffered. This\nmakes it harder for f2p players to become heroes; the rich become richer.</p><h2>Design\nConcerns</h2><p>The ethical problem of realtime dedication is a huge game-defining concern. Player churn is high and pug towns often do not entail playing with 40 people, but anywhere from 25-30 after three days of inactivity causes them to dehydrate.</p><p>An immersive tutorial would probably help, but there’s enough information in the Newbie Mode UI that anyone should be able to get by. Still, often the first question a newbie has is what to <i>do.</i></p><p>Motion Twin’s achilles heel is luck-centric design, and it shows in Die2nite. Indeed the majority of items and buildings are randomly discovered, and the map is randomized such that important locations can spawn very close or far from a town.</p><p>Finally, the game encourages passive aggression. The gate is one of the worst mechanics in Die2nite, and the game would be wholly better without it. The implications that Last Man Standing brings are worth having, but a scaling reward system for highly successful towns would be welcome: give <b>2+ </b>players some hero days if they managed to be highly successful.</p><h2>The\nTinydark Takeaway</h2><p>Given\nAdobe&rsquo;s announcement of discontinuing Flash in 2020 and Motion Twin&rsquo;s\ndisinterest in the Twinoid platform, it is assumed we will completely\nlose access to Die2nite before 2021. If proven viable, tinydark could\ncreate a spiritual successor to D2N.\nOur\nproprietary game engine&rsquo;s development turns toward multiplayer\nexperiences, a spiritual successor to \n\nD2N\n\nis a strong\npossibility for the studio.<br/></p><p>Die2nite&rsquo;s\ndesign is experimental and the experiment wasn&rsquo;t a huge success; for\nhow many people sign up to towns, many go inactive soon after and D2N\nin particular has had a lot of exposure it hasn&rsquo;t been able to\ncapitalize on. What makes D2N great is also its greatest weaknesses, and overcoming those obstacles while still retaining the feel of the game may be impossible.</p><p>But there’s a ton of value in trying. For a small studio striving to one day be full-time, filling a void left by a dying game can provide a good opportunity for growth. The game design also lends\nitself to a <b>subscription\nmodel</b>:\nDie2nite isn&rsquo;t a game you pick up for three days and drop for a\nmonth. You&rsquo;re surviving sometimes as long as 21 days with the same\ncharacter in the same town, to do it all again next time. To this\nday, some top players have never had a long stretch of time where\nthey&rsquo;d actually quit. Subscription models are sustainable and we could charge significantly less for “hero time”.</p><h2>Proposed Design Improvements</h2><p>Here are some <b>cursory</b>, <b>macro-level</b> changes that I have in mind.</p><p><b>1, 5, 20, 40, 100 Players</b><br/></p><p>The game should be able to be played in small groups, with scaling difficulty. Truthfully, supporting a 1 player map is a dream, but I would like to strive for it. Organized play will not require the “coalition jumpers” that D2N does. </p><p>Each tier of segregation will allow the creation of a character: you’ll be able to have a solo character, a character each in a <i>small </i>5 map or an <i>epic </i>100 map. This will allow the player to stay engaged with the game even if they are waiting on others’ actions. I am considering a means of hotjoining a town.</p><p><b>The Attack</b></p><p>I am having a lot of difficulty imagining an ethical system involving one single attack phase per day. What may happen is that hordes work their way toward the town, Walking Dead style, organically. These hordes would be composed of existent, killable zombies. Advanced notice would be given for this event. The town falling will send the map into panic mode.</p><p>Direct zombie combat will be handled by the engine’s encounter system and will be auto-attack, though not necessarily simple. The town’s defense will likely be handled by the same system, with everyone joining a “party” and the zombies aggro’d to defensive structures first. Walls may not initially be built for the players.</p><p><b>Immersive Design</b></p><p>There’s a lot of potential in the environment that videogames rarely realize due to the nature of 3D environments. As I sit in an office typing this teardown, I see a desk that can be used a barricade, dumbbells as weapons, furniture that could be deconstructed, electronics that could be used to confuse a zombie horde, and some food. Not only is it nonsensical that five players hitting Search on a building removes every useful thing from it, but it does the design an injustice: our real world is littered with useful objects, but in the apocalypse, it’s a matter of what we can carry. Inventory management and deconstructing objects will be a focus.</p><p>Explorable areas should have multiple buildings, if the locale allows, and I would like that to be the default means of finding useful items.</p><p><b>Soul XP and Composite Classes</b></p><p>There will be soul experience similar to how Die2nite works: the longer you survive, the higher the score. I want to offer bonuses based on levels of participation, but that will be dependent on how participation is defined, and that’s difficult to measure. Soul experience will be level-based and each level will offer new options to build out your future survivors.\n\n</p><p>From Level 1, the player will be offered only the ability to be a basic survivor. Even modest success in their first town will reward enough exp for Level 2, which will give them a few options to choose as a class. As the player progresses, more classes will become available for play, and eventually I expect that we will offer a perk slot in addition to the class. This offers both <b>horizontal</b> and <b>vertical</b> progression, but with an emphasis on the <b>horizontal </b>once the perk slot is unlocked.</p><p>&ldquo;Heroes” will be rewarded with the ability to specialize their class; a tamer’s dog could return sooner, a looter may be able to find an object in a depleted building, a cook may spawn with ingredients. Alternatively, simply offer them the ability to take a second class.</p><p>There is one problem with accruing soul XP: I want people to be able to play multiple characters across town types. This experience system would encourage people to make as many chars as they can, to progress quickly. I may have to limit XP earned, and perhaps unlimit it for subscribers/heroes. Another suggestion has been to award XP to characters themselves, who’d be persistent entities.</p><p><b>A Town At All?</b></p><p>More likely to be a game mode than the default gameplay, but people could random spawn anywhere (safe) on the map. I like the idea of towns being organically created around anchor buildings, but I fear the system’s far too ambitious for one tiny dev.</p><p><b>Other Mentionables</b></p><p>There will be distinctions. (already built into <a href=\"https://tinydark.com/\" target=\"_blank\">The Hub</a>) Distinctions that encourage self-centric play should not exist; players should not earn distinctions for fixing <a href=\"http://d2nwiki.com/wiki/Incomplete_Whisk\" target=\"_blank\">certain broken items</a>, thus using resources.<br/></p><p>I am considering different types of zombies, maybe horde leaders. Think of the special infected from <i>Left 4 Dead</i>.</p><p>More support for roleplay, writing character descriptions and nick-naming people.</p><p>The game should be good at telling game stories. The time the player took a risk, searched that extra spot, found that crucial item or building, made it home just in time.</p><h2>Similar Games</h2><p><b><a href=\"https://store.steampowered.com/app/850290/Grimmwood_Open_Beta/\" target=\"_blank\">Grimmwood</a> </b>(dead)<br/></p><p>Successfully iterated on d2n’s design, and a Steam release is fantastic progression for the genre. Unfortunately it collapsed under financial weight. Die2nite’s formula is too niche to rely on a hit-based model and the game was not popular enough to keep the servers running.</p><p><b><a href=\"https://www.arctic-lands.com/\" target=\"_blank\">Arctic Lands</a> </b>(dead as of 2020)<br/></p><p>Inspired by Die2nite, but snow where there was sand. More emphasis is placed on personal survival and I suspect The Long Dark was an inspiration for the developer. Unfortunately its development appears to be stagnating and the game is technically unimpressive.</p>",
    "summary_html": "Die2nite Teardown",
    "photos": []
}