{
    "id": "190004979392",
    "state": "published",
    "timestamp": 1577924430,
    "date_iso": "2020-01-01T19:20:30-05:00",
    "title": "2019 Annual Review",
    "permalink": "https://vael.tumblr.com/post/190004979392/2019-annual-review",
    "tags": [
        "annual review"
    ],
    "type": "text",
    "body_html": "<p>Each year, I look back at the previous year’s annual review and note that things didn’t go as planned. For some reason I am always surprised, but this time it’s a little painful, too. From <a href=\"https://vael.tumblr.com/post/181590750932/2018-annual-review\" target=\"_blank\">2018′s Annual Review:</a></p><blockquote><p>“2019 outlook? Sunny! I hope it will be my best year yet.“</p></blockquote><p>Oh, Vael. You built your house, you moved to the promised land. But your year did not go as planned. You are not even close to the <i>zen</i> you craved.</p><p>It has been a wild year. This will run long. All I can do is stick to the format and hope my memory and average writing skill will do the year justice. So, as usual, we start with the positive.</p><h2>What went well this year?</h2><p><b>We like our house.</b> We do. The builder was no good, resulting in some warped walls and a <i>lot</i> of headache getting them to finish everything properly, but the layout is very suitable for us. My office is exactly what I needed, our TV room has just the right space for us. We finally have a respectable kitchen. Since I’m living and working in the house 24 hours a day, it’s important to have a comfortable space.</p><p><b>Game development.</b> For the past five years, <a href=\"https://tinydark.com/about\" target=\"_blank\">I’ve put in some serious work.</a> A lot of it was within my game engine, GAM3, and tinydark’s gaming network, The Orbium. While I put in a lot of work, not much came in the way of actual games produced. I finally rallied in 2018 and put out Bean Grower. It was designed to be a supplemental game, not a main driver, so it will not bring in sustainable income. I went on to think that I should open GAM3 up to other developers, license the engine out and collect a share of what they make.</p><p>I resolved to <i>refactor </i>GAM3: a word which means to rewrite and modernize many parts of it so that it’s easier to work in, and for it to present better. I would come to realize this desire to share GAM3 was due to a lack of confidence in myself to produce something great, and financially sustainable. Around the time I was realizing that multiplayer was the answer, I discovered Marosia.</p><p>Then we moved, I took on contract work, and things generally slowed for me for a few months, eking out what development I could. I played Marosia throughout and in August, it died. <a href=\"https://vael.tumblr.com/post/187440576007/marosia-post-mortem-teardown\" target=\"_blank\">I wrote a teardown for it.</a> The stars had aligned: though I had a lot of prelim work to be done, I would make a successor to Marosia. I managed to hype a few people in the community with a demo of GAM3 and I spent the next few months coding a chat prototype and generally organizing myself, and finally mid-November began the refactoring. It would end there, but just this morning (seriously) we learned Marosia was coming back. I had a momentary freakout but it’s ultimately a good thing for my own game.</p><p>I haven’t been more excited for a project in a long time. I never thought I’d be so excited to create a standard fantasy world, but it’s a ton of fun, with intricacies I never considered. The game’s design lends itself to a sustainable monetization model: I’m thinking $3/mo for quality-of-life upgrades, with a discount for buying in bulk. I would have paid double for Marosia, so I think this is fair. (6 months of die2nite is currently priced at $69, 6 months of Hattrick is $90!) And most important of all, I can do it ethically, with a game that truly means something to people.</p><p><b>Web development.</b> I’ve learned quite a bit this year! I am so grateful for <a href=\"https://svelte.dev/\" target=\"_blank\">svelte</a>. I liked but never loved React.js. It always felt ponderous to me. I have no doubt The Orbium’s refactoring would have taken me half the time it did if I were learning svelte vs. React, simply because React is so much more convoluted than svelte, and all in the name of uglier syntax. Svelte seamlessly integrates style and functionality into UI components, which means that if I’m working with a button that clicks to open a modal, everything I need for that button is in that one file.</p><p>Due to my contract work (with Harley Davidson, I can reveal) I also got some experience with Symfony and other modern development practices in PHP. PHP doesn’t really excite me these days, loathing having to produce views with it, but it is at least comfy.</p><p><b>My job.</b> “Yeah, yeah.” I got a raise, most of which was contributed to getting Eve and my son onto my badass healthcare plan. We’re developing like it’s 2012, which is frustrating and makes even simple tasks take forever, but I can’t complain about the pay nor the stability of the company and my position there. I also work <i>mostly</i> remotely.</p><h2>What didn’t go so well?</h2><p>2019 was dominated by the bad. Eve’s not putting out an Annual Review, but our pain is shared.</p><p><b>The move.</b> 11 months after the contract was signed, our builder was finally ready\n\n to let us move in. The house was not finished, just livable. So we rushed out of Rhode Island. We packed my car with everything we could fit, even removing the spare tire, but we got almost all of it. Me, Eve, our son, and our two cats.</p><p>At around 7:30 PM, we were driving on a dark highway when we were struck by a muffler that had fallen out from the truck in front of us. It destroyed the front-end, spilling radiator fluid onto the road. I had no idea what was going on, but it so happened that a mechanic had broken down right near us and was able to help. The engine barely carried us to the nearest motel, and I was in shock. I carried all our stuff to our second-floor room, it was even lightly raining. And I was defeated. Eve reports she had never seen me so bad. I had no idea how long we’d be in this ghetto-ass motel, what it would cost us during this time of great financial need, and mostly: I was just miserable. We could have died. If it had hit one of our tires, we could have spun out at 70+ MPH. All I wanted to do was get to our house the next day, and here we were.</p><p>I won’t detail the rest here, but I do want to thank my friends for their support and appreciate the good fortune that we got through this time.</p><p>We got to the house at 11PM on a Sunday; I still appreciate our builder taking the time to show us around so late. And&hellip; it was not at all what we were expecting. We had <i>no </i>driveway, and it had rained. We were tracking in some mud but that didn’t even matter because the entire house had to be cleaned. There was dirt all over the floors, they’d forgotten I didn’t want a chandelier over the dining room table, and the feeling was that we’d gone through Hell (and austure financial practices) to get here and this was it. So much wasn’t done. We knew that, but we didn’t think we’d be sweeping and wetting the floor with paper towel just to have a place to put our stuff. Shoutout to my friend Cody for setting us up with a supply drop.</p><p>We spent a lot of time buying furniture, aided by our rental SUV, all the while worrying about our newly purchased things sitting around the house without our protection as workers came in and out. I had to go back to Virginia to pick up the car and through exhaustion, caffeine, stupidity, and anxiety, managed to go 88 MPH and get myself a ticket: a misdemeanor, even. I spent the entire day picking up that damn car (5 hours up and down) and returned home in the worse state I’d ever felt. I was emotionally, mentally, and physically depleted.</p><p>But there was no stopping for me: I took on contract work and I had to get it done just to stay afloat. And then we got a fucking dog.</p><p>\n\n<b>The dog.</b> At some point in 2018 we determined that our son could use a companion and that a dog really completes the family. Leading up to the move, we put a down payment on a rough collie: the “Lassie” breed. They usually run around $800 and we got her for $500. I was a fan of the breed and Eve had done research that proves it’s a great breed. (it is) Even after the accident, we thought we should pay the rest for her and bring some joy into our life.<br/></p><figure data-orig-width=\"3546\" data-orig-height=\"4000\" class=\"tmblr-full\"><img src=\"https://64.media.tumblr.com/22b5e66477a87245a794357527ddd60b/943d422e332cdd19-2a/s540x810/97550b679daf631d7cc067fcf076f25940086454.png\" alt=\"image\" data-orig-width=\"3546\" data-orig-height=\"4000\"/></figure><p>We named her Esme, and getting a dog was definitely one of the worst macro decisions I’ve made for the family yet. I couldn’t last more than a month with her. It was my decision to get rid of her, which made my wife and son sad but we were getting so little out of the experience. The cats beat her up, she was afraid of everything, and all she wanted to do was run around but we kept her cooped up in the house because we had no fence. I hated that there was still a dog smell, and I hated that it farted during Game of Thrones. It was over when we went grocery shopping and came back to a poop-filled crate, which the circumstances of the night dictated I must clean.</p><p>\n\n<b>Young Living.</b> Eve was supposed to sell essential oils for some side money. We knew it wasn’t going to be big money, unless she got lucky or turned out to be a natural-born saleswoman, but it was something to do and we believe in the products. I really trust in Young Living and I personally have seen the benefits of their oils and products.<br/></p><p>So she went to the YL convention in Utah to learn to sell and, hey, have some fun. She returned feeling even less confident: they’d changed some numbers, and the truth that we always knew was that the market’s highly saturated. There are memes trivializing the effects of oils and there’s no denying the company’s an MLM. A lot of the big earners made their sales early on. Coinciding with the <i>bad feels </i>of Autumn, we decided to put the oil dream aside and focus on mental and physical health.</p><p><b>Eve mental/physical health.</b> The muffler changed a lot for us. It morphed what should have been a very happy time in our lives into a very stressful one. Eve felt fatigued and broken down, and I wasn’t much better off. One day before her planned <i>back-to-action, pick ourselves up and get ready to enjoy Summer</i>, she sprained and tore a ligament in her ankle while coming down the stairs. We hoped it was just a sprain and did everything we could to avoid going to the doctor, but a week later she hadn’t gotten better and so began the PT and bullshit regimen. Our plans of hiking the blue ridge mountains were crushed.</p><p>But she recovered, and I shit you not, the very day before she planned to return to action, it was Father’s Day. She was making me my special breakfast and was using a hand-blender to blend pumpkin french toast mix when she went to clean some gunk out of the blender with her finger. It was a split-second decision to help make breakfast faster. Her finger twitched, caught the <i>irresponsibly sensitive</i> power button and tore her finger up. Immediately took her to Urgent Care and then the Emergency Room. $3,000 and some luck later, she kept her finger, but has permanently lost some feeling in it.</p><p>That was a bad time for us. I was overworked, she was miserable, and yet she still managed to get to Utah to learn how to sell. To salvage our year. In Autumn, all the anxiety, stress, and the damage from her upbringing finally culminated and she broke. </p><p>Her physical health tanked in tandem with her mental. She suffered frequent menstrual issues and her EDS (a joint disorder) flaring up. It is hard to detail all the pain and frustration, and it really is beyond the scope of what needs to be said. My wife is depressed, prone to feeling overwhelmed, and I’m happy to say that we are getting her professional help soon.</p><p>What’s remarkable is that I can’t recall a period of time that she didn’t try her best to recover. Every month, most weeks, she would constantly express that the next day or month was her time. She’s done it for this month and 2020 as well. And I don’t think she’s lazy or unmotivated. She is just defeated and I am a poor comforter. Honestly, I am just shit at helping people if the solution isn’t “well just force yourself to do the thing.” That’s how I get through my problems and it doesn’t work for everyone, not even always myself. Still she is strong. I think writing this out has helped me remember that.</p><p><b>Relationship with my son.</b> I had hoped my increased efficiency and happiness would improve our relationship. I planned for more structure: things like “once we’re upstairs for bedtime rituals, no going back down.” Each night I make a point to spend a minimum of 30 focused minutes with him. But I have only succeeded in making our relationship worse. I don’t think he needs professional help, but there is something within him, from when he was three years old, that just prevents him from being a hard worker. Respect is important to me and I don’t respect him. He is a frustrated child, often not understanding the world, often forgetting things he was supposed to do. I’m not doing a good job of helping.</p><p>I think I could have done better, but there were simply too many fronts to fight.</p><p><b>Mental performance.</b> I haven’t gotten any better from last year. I am still not as sharp as 2017-Vael. It is a matter of stress and lifestyle.</p><h2>What did I learn?</h2><p><b>How to be a homeowner!</b> Generally how to manage a home. I got my tools, all cute with my little leaf blower.</p><p><b>SLOWWWW DOWWWWN.</b> The outside of the house needs some work. We need to extend our driveway, clear an acre, and put up a fence. I <i>could</i> take a loan out to do this and be fine, but I <i>could</i> also just slow down. Take a deep breath. Enjoy what we have for the Summer. It sucks I won’t be able to use that acre for farming, but I think I have a good place to plant a single apple tree this year. And hey, less mowing.</p><p><b>A shit ton of web development.</b></p><p><b>Probably became more cynical.</b> But I think <a href=\"https://en.wikipedia.org/wiki/The_Good_Place\" target=\"_blank\"><i>The Good Place</i></a> has helped remind me to be a good person.</p><p><b>To just accept Eve needs help.</b> And that I really suck at helping her.</p><h2>Future Outlook</h2><p>All that bad stuff that happened? Pfft. Shitty year. 2020′s here, it’s a brand new decade. I’ve got a cool game I want to make, we’re gonna get Eve some help, and&hellip;</p><p><b>Get pregnant!</b> Yeah! Right now we definitely aren’t ready for kids. We need to use our new health insurance to make a bunch of appointments, recover  financially, mentally, physically. But we very badly want more children. I feel it all the time. I have begun to suspect that genetics do matter, and I wonder if Abel’s laziness mirrors his biological father’s laziness. My dad loved to work and I do too. It might be possible to pass these traits on.</p><p><b>Better office.</b> I need to get some furniture and improve my work environment.</p><p><b>Vacation! </b>We desperately need a vacation. We’re going to Disney this year, either May or June.</p><p><b>Zen Vael.</b> I will attempt to be “the person I want to be” as detailed last year. My soft goal for this is March 15th, as I set last year. I will undoubtedly fail that date. There is no way I’m wrangling my sleep and attitude in the next two months, but surely by the end of the year?</p><p>Thanks for reading.</p><p><i>Vael</i></p>",
    "summary_html": "2019 Annual Review",
    "photos": []
}