{
    "id": "634149707769430016",
    "state": "published",
    "timestamp": 1604772289,
    "date_iso": "2020-11-07T13:04:49-05:00",
    "title": "Marosia Design Analysis (2020)",
    "permalink": "https://vael.tumblr.com/post/634149707769430016/marosia-design-analysis-2020",
    "tags": [
        "marosia",
        "pbbg",
        "roleplaying",
        "vaelvict.us"
    ],
    "type": "text",
    "body_html": "<p><i><a href=\"https://niram.org/read/\" target=\"_blank\">Estimated reading time: 14 minutes.</a></i><br/></p><p>Today I’ll be analyzing the game <i><a href=\"https://marosia.com/\" target=\"_blank\">Marosia</a>.</i> I’m developing a game like Marosia. <a href=\"https://tinydark.com/blog/state-of-the-studio-oct-2020\" target=\"_blank\">(see here)</a></p><p>This is an update on the <a href=\"https://vael.tumblr.com/post/187440576007/marosia-post-mortem-teardown\" target=\"_blank\">original “teardown”</a>. The game (dubbed by players as <i>Newrosia</i>) returned under new ownership and has gotten some updates; additionally, I’ve learned a lot about roleplay and these types of games in the past year and have some deeper insights.</p><p><b>Update Dec 30th, 2021: </b>After over three weeks of hiatus, the game has returned now with its fourth administrator at the helm. The golden rule and two-day rule have been done away with, and the rules generally received a spiffing-up.</p><p>And my project, titled URPG, has grown in scope and ambition. <a href=\"https://trello.com/b/EAOHAfUm/tinydark-roadmap\" target=\"_blank\">See the roadmap for details.</a></p><h2>What Is It?</h2><p>Marosia describes itself as an RPG in a fantasy setting with open-world society simulation mechanics<i>.</i> &ldquo;The free-to-play collaborative story” is its apparent slogan. It is an open-world RPG which boasts an entirely player-created world and a complete absence of traditional NPCs. Movement is tile-based and the world feels large, even if it is much smaller than similar games.</p><p>As a player, you are required to roleplay. This means you’ll speak in-character and your character will have to learn about the world through their own experiences. They don’t know a volcano lies two tiles away just because <i>you </i>do, nor do they know the word of the gods or any historical events that haven’t been written down or retold. Character progression is slowed if you have not made a roleplay post in the last four days. Inactive roleplayers are generally not cared for and are dubbed “sleepy.”</p><p>Your first character will have to be an adult, but future characters may choose to be children: mildly helpless but with inherited abilities, a longer lifespan, and a chance at magic. You will spawn with others of your race and where it goes from there is up to you. Most characters will first acquire tools and clothing, either through craft or donations. As time and events progress, active roleplayers will begin making friends and plans. Throughout it all the player will be engaging mechanically through the world via Projects, and the results of those mechanics (producing clothes, tools, taming animals, constructing buildings) help reinforce the roleplayed events. They also serve to constitute world and character state in an easily understood manner: you cannot claim to be wearing an item you aren’t, and the game offers immense flexibility to world-build via the description of items and buildings.</p><p>As a new player, I was fascinated by its roleplay backed by an open-world model. When I jumped in, playing a female sanguine (vampire), I simply spoke “Hello?” into the void and an “Adult Female Sanguine” spoke back, welcoming me to the settlement I spawned in. I was hooked the moment I understood that I was to learn this person’s name through roleplay, and assign them a name myself. I realized that anyone could lie about their name and be a different person to other people. All across the game world, people are constantly roleplaying, plotting, starting new societies, and new bloodlines. It truly is a persistent story, and forever expanding, with a Game of Thrones-like complexity.<br/></p><h2>Core Loop</h2><p>Because of the focus on roleplay and society-building, it’s hard to pin down what a player is <i>expected </i>to do, but at any time you’ll be running a <b>Project</b> to forward some goal. Progress will be added to a project every hour depending on relevant attributes or skills. There are a few actions like pickpocketing or hunting which are immediate and do not require a project.</p><p>The project system is simple and versatile. <b>Crafting </b>is done through projects and enables creation of many valuable objects, from weapons and armor, to tools and medicine, to entire structures; even towns themselves. These objects bridge the gap between mechanics and roleplay. Skills are the usual fare: tailoring, taming animals, fighting, etc. all raise their respective skills and your overall attribute. Most projects allow other characters to join in so that everyone can work on gathering the same pile of stone or wood.</p><p>Not all projects are crafting projects. The ranching skill enables the taming and husbandry of animals. A chicken may run through your tile with a letter attached to it for a distant town: attempting to steal it begins a project which scales down in duration according to your Guile skill. Healing yourself will take a base five hours of effort.</p><p>It is fair to say the game loop is flexible and dependent on the status of the project you’re working on, with some minor considerations for keeping your character fed and yourself apprised of the story.</p><h2>Engagement<br/></h2><p>If Marosia hooks you, it engages very strongly. Where it fails will be detailed under Design Concerns.</p><p><b>Project-based skilling</b> means players are often checking in when a project’s nearing completion so that they may start another one and continue building both their primary attribute and the skill in question. The project often ends with a physical product or a chance at obtaining something, adding even more value to utilizing your time. As these skills are built slowly over time and a character’s minimum lifespan is 13 real-life months, investment crescendos.</p><p><b>Creating your story</b> and participating in a collaborative story with others offers novel engagement that produces the same engagement that reading a book or watching <i>just one more episode</i> can produce. The more a player engages with characters around them, the more invested they become in their character, the world, and the game as a whole.</p><p><b>Sense of social responsibility.</b> The truly enmeshed may find themselves feeling like they <i>need to</i> or <i>should</i> continue playing even if they’re personally not that interested. Especially when a player holds a high level of mastery over a skill that their colony relies on, they may want to continue providing their services.</p><h2>Ethics</h2><p>Marosia’s design is fairly ethical. At almost any point, you can choose to immediately cull a character, causing them to die from natural causes if you are tired of playing them. (see Design Concerns) If you just need a break, you can hibernate them for a minimum of one week, putting them into a state where they cannot starve to death or be interacted with.</p><p>Missing an entire day of projects due to real life would hurt the powergamer, but ultimately it would not have such a dramatic effect on progression that the player should feel the need to log in to stay on projects. Sometimes it is the case that short projects will require the player’s attention throughout the day: smelting takes about 2 hours but will often require 10 projects to make equipment. The game provides “factories” that allow players to queue up projects, but they must be manually built and only one can be built per tile.</p><p>In practice, a player will sometimes push bedtime in order to start a new project if one is about to finish; otherwise the character is idle while they sleep. I recommend a default or “fallback” project that the player can set up in cases like that.</p><h2>Design Concerns</h2><p><b>Lack of Tutorial</b></p><p>Games generally explain their rules and systems through tutorials. Much care is given in mobile and browser gaming to adoption and easing friction. For the most part, Marosia tosses you into creation with the expectation that you’ll explore the UI and head to the wiki soon after. While the genre is niche enough and the playerbase better suited for reading documentation for the privilege of play, games should strive to be as self-documenting as possible. There exist a few guides, but they’re located externally.<br/></p><p><b>English and Writing Skill Required</b></p><p><b>English. </b>A friend of mine was reported and told not to play, for his flavor of Asperger’s results in atrocious spelling. I have personally experienced roleplay with people whose primary language was clearly not English, to the degree they did not understand my character’s actions.<br/></p><p><b>Writing skill required.</b> Despite being comfortable writing fiction, I was nervous at first when I saw how active my first town was and how well they were roleplaying. Roleplaying a single character asynchronously was intimidating.</p><p><b>Abundance of Rules, and The Golden Rule</b><br/></p><p>Marosia’s got a ton of rules, and some finer points may be lost on newcomers. I would say most players have &ndash; consciously or not &ndash; broken a rule of varying severity. While other players are around to help, the game’s open-ended roleplay had me seeking help from the game’s original developer to understand how to play an atheist character.<br/></p><p>Of all Marosia’s rules, the <b>Golden Rule</b> is most important. It’s simple: no Out-Of-Character planning. Any knowledge you have of the game world cannot be applied to the decisions your characters can make unless they personally experienced that knowledge gain. You cannot tell your friend you live in Newtown and that their character should join you. If characters on your account will cross paths, one of them will be put into hibernation. The last point leads to awkward situations where a character will decamp their location to allow another of theirs to pass through; the effect is worse if their newly arrived character must stay for a while.<br/></p><p>In practice, many rules are quietly broken in the same way that any strained populace seeks out freedom under dictatorship. It is difficult to enforce rules against OOC planning when the reality is that if a player’s town is being attacked while their friend is at work or school, the friend will ping them to attention. Stories are better when people collaborate Out of Character, so the populace spend time DMing each other and making it clear who they play via Discord.</p><p>I sometimes wished I could just communicate <i>this one tiny thing</i> in [OOC brackets] in an in-game whisper to one character, but I’d be breaking a rule. This may result in ambiguous roleplay required to communicate important OOC information.</p><p>Finally, when I had decided I was done with the game, I made it clear to those around me in-game that I was going to cull. The rules are that you cannot cull if recently attacked, and that you must wait two hours since your last post; just when I thought I’d mastered all the rules, I had forgotten you are, bizarrely, not allowed to roleplay your own intentional death. I put a lot of effort into roleplaying my demise only to find that within 30 minutes, I’d received an infraction and the most recent post was deleted. I think this situation is a quintessential example of how Marosia could improve its policies: the text hurt no one, it offered closure for me and those around me, and the infraction upset me and wasted admin time. Better to offer the player an input box that makes a lovely death-red-colored feed notice with the content of their death post.</p><p><b>Administration</b></p><p>High admin turnover results in a strained administration team. Lacking admins, god characters are now able to be played by non-admins. Evidence of the owner cheating on their personal characters is inexcusable in a world where the integrity of data is critical to the story.</p><p><b>Scale: MUDflation/deflation, Developer Maintenance and Population Growth</b></p><p>It is a shame that an ambitious, open-world fantasy roleplaying game is doomed to such low population.</p><p>Given the trouble the game already has faced even with relatively low player counts, there is no way the developer can support the game at five times the population. Not every developer wants to live off their work, and Marosia is clearly a hobby project despite the many thousands of hours of devotion. But this level of manual intervention is just not sustainable, and the nature of player reports means that a reviewer must spend a lot of time reading text, or otherwise make quick judgments; it’s sadly been conveyed to me that it can sometimes be the latter, but in the one time I was punished for breaking the golden rule in “Oldrosia”, the punishment was generous.<br/></p><p>Gods exist in the world, can be prayed to, and must be roleplayed by a real player: usually an admin. This takes even more time away from the developer who has to respond to prayers. (and it thus opens up the potential of bias) Even if the developer never touched a god again, there would still be maintenance required to ensure fair play.</p><p>Then there are the considerations of game balance scale.</p><p>Metal is a finite resource. Weapons and heavy armor can only be crafted with metal. Combat skills can only be trained if wielding a weapon. Smithing can be leveled to max within a character’s lifetime. This applies to many crafting disciplines. </p><p>Lacking any object decay, the highest quality weapons were theoretically possible to have existed, in perpetuity, after the three-month mark of the game’s existence. The same goes for high-quality food, tools, healing items, and weaponry. This permanently modifies the progression curve of the game and results in a ‘lucky draw’ of sorts dependent on where your character spawns in the world: they’ll either be spawned in a community where these abundant resources exist or not. In two years, it may be impossible for a newspawn to acquire their own weapon.</p><p>In practice, manual effort from the gods may replenish a mine or generate high-level gear for their followers. This is still not sustainable or fair. Even if the developer allows for prospecting of mines, the problem of an abundance of high-level gear remains. And it cannot go without saying: the game crashes for a few minutes every midnight as the world resolves itself; I’m not sure that adding item decay is even <i>technologically </i>scalable.</p><p><b>Dissonance: Asynchronous Roleplay</b></p><p>Posts are made as the player’s time allows, similar to forum-style RP, as opposed to the real-time RP that chat rooms or MUDs require. However, projects and the world are forever ticking away in real-time. The player may be sewing a garment while sparring, or working on some project in the middle of a wedding or funeral. Starting a project indicates that you’re online to other players, but you may not want to signal that when you’re only on bathroom break at work.</p><p>Because roleplay is asynchronous, sometimes you’ll see large posts from people reacting in “real time” to events that happened many hours ago. This becomes especially problematic when you consider that each player has certain active hours depending on their time zone. Given the rule that the player must be in-character at all times, it’s difficult to know when is a good time for <i>others </i>to roleplay with you; but when you are both active and roleplaying in real time, it’s very pleasant.</p><p>Finally, in more active towns, you may find yourself with anywhere from one to twenty minutes of reading to catch up on, as well as form your own reaction to. This makes it hard for the player to predict how long a play session will be, and is what I suspect to be a main driver of the constant burnout we see among veterans.</p><h2>Similar Games<br/></h2><p><b>UPDATE 2022.</b> I don’t want to get in the habit of updating this teardown, but it isn’t right to leave the original text in light of the past three years of change.</p><p>There are only two competitors for asynchronous roleplaying browser games.</p><ul><li><a href=\"https://cantr.net/en/\" target=\"_blank\">Cantr II</a> is the father of asynchronous RP games, nearing its second decade of existence. As such, its UI and codebase are fairly dated. Still, its development continues to plod along slowly. Staff are assigned to certain departments and are even allowed access to a modest content management system to add new objects into the game.<br/><br/>In 2021 they released a newbie-friendly instance of the game called Genesis.<br/><br/></li><li><a href=\"http://www.faerytaleonline.com/\" target=\"_blank\">Faerytale Online</a> requires that your character be birthed by another player in order to play. It took me four months to get in and when I finally did, I was a baby. Zero years old, being able to do little more than create and eat(!) fecal matter. The game’s been abandoned by the developer and as of 2022, has a curious new bug regarding the moon, which prevents any feed message from being generated twice a day, for a three-hour span. <br/><br/>The expectation is it can go permanently offline at any minute, but I do recommend checking it out to see if you can get lucky enough to spawn. I found its mine (and city) system to be worth playing for.</li></ul><p>I previously said that excluding myself, there were two other people that I know of making similar games. Neither of them will be finishing. There is talk of someone new making a similar game, but they are in need of a programmer.</p><h2>Conclusion</h2><p>On <a href=\"https://pbbg.com/games/marosia\" target=\"_blank\">PBBG.org</a>, I’ve given the game a 3/5 with the following review.</p><blockquote><p>Firstly, I praise Marosia for providing a coherent multiplayer browser-based open world experience. It is not common to find this in PBBGs or even mobile games. I then praise Marosia for encouraging roleplay: there’s a lot of potential in RP. Finally, the game’s had an enormous amount of developer time put into it. The original developer had a lot of passion for her game. Her time commitment just purely on the code side is easily over two-thousand hours by my estimation. The new owner has put in some work to stabilize the game via bug fixes and balance changes.</p><p>Unfortunately, I can only barely recommend (3/5) checking the game out and playing for a bit before moving on. Current administration &ndash; who bought the game from the original developer &ndash; has even less regard for your stories than the previous developer did. They are overly concerned with “creepers” and the community that has formed around the game is, as over-used as the word may be, toxic. I do not blame them as people, but rather look to the administration of both the official Discord and the game itself as to why things are the way they are. In a game about crafting your own (albeit collaborative) story, you can lose it in any instant without appeal, for simply coming across the wrong character.</p><p>There are other, design-related concerns that I discuss in my teardown of the game, available here.</p></blockquote><p>If you’re interested in roleplaying in a game world like Marosia, <a href=\"https://tinydark.com/blog/state-of-the-studio-oct-2020\" target=\"_blank\"><b>check out this teaser</b></a> for my upcoming game. It is time our niche had a safe place to craft our stories. It is time for our niche to grow into more than a niche. Roleplaying has huge potential and this game is only the first step on my game development journey to bring it to a wider audience. That will not be done through intensive rule-enforcement nor complete exclusion of non-roleplayers. I aim to be part of the solution.</p><p>Thanks for reading,<br/><i>Vael Victus</i></p>",
    "summary_html": "Marosia Design Analysis (2020)",
    "photos": []
}