{
    "id": "640415184960274433",
    "state": "published",
    "timestamp": 1610747513,
    "date_iso": "2021-01-15T16:51:53-05:00",
    "title": "2020 Annual Review",
    "permalink": "https://vael.tumblr.com/post/640415184960274433/2020-annual-review",
    "tags": [
        "annual review",
        "2020"
    ],
    "type": "text",
    "body_html": "<p>I began writing this late December but opted to wait until our baby was born to finish it. This is being posted on <b>January 15th, 2021</b>. <a href=\"https://vael.tumblr.com/post/190004979392/2019-annual-review\" target=\"_blank\">2019 review here.</a></p><blockquote><p>“2020′s here, it’s a brand new decade!” - Last year’s annual review, so full of hope and possibility<br/></p></blockquote><p>Yes. Well. Actually, it was a fantastic year for us, relative to the rest of humanity.</p><h2>What went well this year?</h2><p><b>We had a baby!</b> Our daughter Violet was born January 5th. She’s healthy and was exceedingly healthy all throughout the pregnancy, which I credit my wife Eve for. Eve didn’t take a sip or bite of anything she shouldn’t once we started trying, and took all the gross supplements she should.\n\n She suffered intense insomnia since month 2, but never took medication for it. I’m very proud of her and being a new dad again\n\n (we have a 10-year-old son)\n\n is invigorating.</p><p><b>My work and work ethic.</b> This one’s going in the not-so-well pile, too. </p><p>I had thought my days of <a href=\"https://monbre.com/\" target=\"_blank\">MonBre</a>-level work ethic were over. That I did not have the energy to develop like I once did. 2020 made my childless bachelor game-dev days look like a lazy Sunday.</p><p>Most of my spare time was spent in my game engine, GAM3. I started refactoring in November of 2019: almost completely rewriting the player experience from scratch. I considered the refactoring ready &ndash; not done &ndash; in June. That’s eight months. I added plenty of new features to the engine and developed Elevator during that time, but I was hankering to get my hands dirty with the bigger features like ground and feeds.</p><p>In August I decided to drop social media usage and have an “ascetic” week of work. It was largely successful and subsequent, similarly themed weeks had me feeling productive and satisfied with what I was making. From that point on, I grinded hard to get my next project (URPG: Untitled Roleplaying Game for now) ready for playtesting. I finally did a soft release on December <b>26th</b>, not pinging the playtester role on our Discord, expecting a few people to show up. We had <b>15 </b>players by the <b>30th</b>. Reception’s been great, and I’m confident that I have something worth playing&hellip; and supporting.</p><p>As an aside, I did \n\nnaturally\n\nbecome a better web developer, but I didn’t learn as much as I did in 2019.<br/></p><p><b>Fitness.</b> All it took was seeing one COVID pound. I realized I’d been neglecting my body for work (oops, would end up doing that again) and set out to correct course. In October I looked and felt the best I had in years. I was borderline ready to declare I had a rockin’ bod!</p><p>I intended to work on my pectorals, but the best exercise for them also flared up my thoracic spine issue, and I certainly didn’t need to spend <i>more</i> time exercising, so I stuck with dumbbells-and-YouTube and some ab work at night. I walked our 2 acres almost daily.</p><p><b>My job.</b> My workplace only benefited from COVID-19. Our client couldn’t cope with 5,000 employees suddenly having to work from home, so projects slowed and we found ourselves idle, yet always with a project on the horizon: delay after delay. This opened up a lot of time for my own projects, and to manage my son’s e-learning. I received an income boost to help with new baby things as my boss wanted to make sure our new baby was well-supported. I am very grateful for the stability of the job I have.<br/></p><p><b>We figured out Eve’s health problem.</b> She was diagnosed with hypothyroidism early this year. That was what plagued her &ndash; “the wraith” I would sometimes call it &ndash; all these years. In light of this revelation, I felt guilty for what I’d sometimes think of her. Well, she’s on medication for it. We’re expecting to get on <i>better</i> medication for it after the baby. She did see a therapist for some time before the pandemic quelled the effort. It was beneficial but ultimately not worth pursuing in the near future.</p><h2>What didn’t go so well?</h2><p><b>Working too hard.</b> All that production came at a cost. I simply did not make much time for myself. I also failed to uphold my word on not letting it affect the family. With babytime looming over me, I felt like I should fit in as much work as possible. (and to show for it: I released, which makes me happy)<br/></p><p>I estimate I got about 2 hours of recreation time per week day past August. I slept about seven hours per night. I’d spend most weekends working this way, rarely escaping for an extended game session and getting a little more sleep. I juggled caring for a pregnant sleepless wife, dealing with my son and his e-learning, exercising, and still working my main job and side job, on top of all I was doing for GAM3. Here’s a bit of what that looked like.<br/></p><ul><li>Videogames are my primary source of stress relief. I had a list of games I wanted to complete, but I couldn’t make the time. It took me almost a month to play through Agony Unrated. Being unable to set aside solid hours at a time meant I made more time for browser games Fallen London and Melvor Idle; neither quite hit the stress-relieving itch I needed, and that took me a while to accept. (and do little about)</li><li>One night in November, I went into a game and just couldn’t enjoy myself as I should because I knew I had work to do. That is dangerous. I actually Googled the word <i>workaholic </i>to find resources for people who might be like me. \n\n</li><li>I’ve become dependent on caffeine. I’m planning to let up now that Violet is here, but I know I’ll be doing at least three days a week for the foreseeable future.</li><li>My self-imposed deadlines were insane and this has been my worst year for time estimates. Because I would make poor estimates, I’d castigate myself and press on: it was, after all, my fault, so I should suffer. (this is what Vael does) And I just kept going, I rarely crumbled.</li><li>Rarely. There were two times. The first isn’t notable, but the other was a little troubling. In early September I think I experienced the onset of a panic attack. I felt short of breath, dizzy, and immediately just laid down outside on the patio. I was able to overcome it and I decided to rest for the remainder of the day.</li><li>I grinded my hardest in December. I started to skip reading the daily baby information Eve would send me. When she pointed this out to me, I felt terrible because it was entirely due to the grind. I fell out of the habit of exercise and taking walks. I’d just forget or brush off the notion.</li><li>I became noticeably irritable when I’d realize there was more work to do, or I ran into a blocker. While this is human nature, it was worse given the state of everything.</li></ul><p>So, my work habits were problematic. I’m trying to take it easy until mid-February and keep myself in check thereafter. I’ll try not to go too hard, but I know me, and as my project and the interest in it  ramps up, I have a feeling I’ll be mentioning overworking in my next annual review.</p><p><b>Loneliness.</b> Eve’s sleep rapidly decayed to the point that we could no longer sleep together without keeping each other up. Insomnia is a common symptom for pregnant women, factoring in biological changes and <i>a living creature partying inside you </i>at any given hour<i>. </i>A good day for her was waking up at 2PM, and I spent most days expecting only to see her from supper and beyond. I know it played a part in my desire to <a href=\"https://www.twitch.tv/vaelvictus\" target=\"_blank\">stream on Twitch</a>. I am thankful to all who kept me company, we had some fun.</p><p><b>COVID-19.</b> Obviously, the pandemic sucked. It killed entertainment, restaurants, our Disney vacation, and life as we knew it. It played into my loneliness.</p><p>I had trouble fighting the constant desire to learn more. I was fairly woke on COVID: I enjoy the subject of epidemiology. I learned of nCov mid-January and recognized “coronavirus” and “China” together as a bad thing. I watched with great interest as China’s own government suppressed information and the nation went on with their New Year celebrations. I Facebook-posted my deep-enough-dive into everything we knew at the time, on January 27th. My family was all stocked up for the end of the world mid-February. When lockdown hit the US, I dove in again.</p><p>But I was becoming obsessive and even straying from the disease itself into conspiracy theories and it was time to stop. It was also difficult to find good research at times, especially early on. </p><p><b>Relationship with my son.</b> Slightly worsened. If we had a good chance this year, it was nulled by his ever-presence. Instead of our Disney vacation that we were supposed to be making all about him, we were home under lockdown. Instead of socializing at Summer Camp and school, he was home. His behavior tanked, with myself and the pandemic equally to blame.<br/></p><p><b>And, of course, cognitive performance.</b> No improvement. Clearly I am too enthralled in the romance of overwork to take care of myself. Post-baby I was predictably dead and made more bugs in URPG than is acceptable.</p><h2>What did I learn?</h2><p>Besides what I mentioned in the above two sections.</p><p><b>Character development.</b> Multiple times this year I recognized that I had learned something about myself, which was surprising for a (now) 32-year-old me. These are personal things.</p><p>I also learned about the work of Jordan B Peterson! His lectures helped make some of my abstract notions more concrete, but I have a lot more of his work to dig into.</p><p><b>Time management and deadlines.</b> I finally realized my problem with time management! It was assuming things always go according to plan. In the case of code, I always forget how much time <i>styling and design</i> will take. I’m trying to improve, and most pertinently, just not give time estimates until I improve.</p><p><b>Garbage in, garbage out.</b> A good source of early COVID news (and leaks) was 4chan’s /pol/ board. I’d click on other topics and all I’ll say on the matter is to be careful what you consume. I found myself getting unreasonably angry over shit I shouldn’t care about (and have no control over) and will be more conscious of this effect.</p><h2>Goals and Expectations: 2021</h2><p><b>2021.</b> Is going to suck for greater humanity. The supply chain is straining. Some businesses aren’t coming back. Many people are still (smartly) waiting to see the long-term effects of the vaccine. 2021′s Summer won’t look much different than 2020. There might be a financial crisis coming, but I’m not sure what that will look like or when it will happen.</p><p>My family will try to stay afloat. We plan to start going out in April. Outdoor activities such as going to the park and dining <i>al fresco</i> are made more accessible by the warm South Carolinian climate. There’s a long paved walk/bike path only 15 minutes from our house and I’d like to take family walks there with Violet in the stroller.</p><p>We expect to send our son to attend school in 2021, and for there to be a mask requirement through 2022. e-learning requires one to be a self-starter and he is anything but, and even if he were, I’m not satisfied with the education he’s getting. Returning next year is a must.</p><p><b>Parenting.</b> I’m all about what I call <i>dividends</i> with parenting. You get what you give: show them love, patience, and empathy. Smash those developmental milestones. Your reward will be a happier child, better poised for success. I have high expectations for my children, which means I have high expectations to meet as well. I have to make Violet a focus. I hope to find some way to socialize our son and give him a Summer.</p><p><b>Body.</b> I want to be “the best shape I have ever been in”, as I say. Cardio is the most important because I need the energy to keep up with small children. I will try to figure out something for the pectorals.</p><p><b>URPG Release.</b> I’m fairly confident I’ll be able to finish all the work I need to release my next game. There will be plenty of updates to follow for the first half of 2022, and anything beyond that will depend on the level of support I get for the game.</p><p><b>Establishing tinydark as an actual company.</b> No, for real this time. I did want to do it in 2020, but the whole pandemic thing made it difficult and anyway it’s not like I planned to make money in 2020, so.</p><p>See you next year!<br/><i>Vael</i></p>",
    "summary_html": "2020 Annual Review",
    "photos": []
}