{
    "id": "675133492210925568",
    "state": "published",
    "timestamp": 1643857471,
    "date_iso": "2022-02-02T22:04:31-05:00",
    "title": "Noita Review",
    "permalink": "https://vael.tumblr.com/post/675133492210925568/noita-review",
    "tags": [
        "noita",
        "vaelvict.us"
    ],
    "type": "text",
    "body_html": "<p>Every good game starts the player off with the basics and gradually introduces new systems through gameplay. I liken this to a baby learning how to sit up, then crawl, then stand, and finally toddle around. Once they&rsquo;re sufficiently mobile, the baby explores their surroundings, and the parent supervises them to ensure safety.</p><p>The same is true of Noita, except that your parent is two rooms away on a conference call, your gate exists but hasn&rsquo;t been properly secured, and a random one of your ten toys will explode the moment you touch it.</p><p>So will go your first few hours in Noita. You proceed cautiously at first, do something reckless and respawn to try again. You gain confidence  in a run and then learn that the electric sparks at the end of your new wand will electrocute when you touch water. You conquer the enemy-dense Hiisi Base and your reward is <b>YOU HAVE ANGERED THE GODS</b> because a wurm or giant green spider ate into the holy mountain. How long will it take you to reach the bottom and defeat the final boss?</p><p>For me, an experienced gamer, seventy hours. The game can be speed-run in about fifteen minutes with enough luck and skill, but I chose the slow grind of returning to previous areas and farming gold for my first successful run. Now that I&rsquo;ve learned the enemies and how to build wands, I think it&rsquo;s fair to say this strategy would yield success more times than not.</p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"726\" data-orig-width=\"895\"><img src=\"https://64.media.tumblr.com/14af21ec637461e4a51b309161abf44d/7d8ebcb29f76f86e-e0/s640x960/3c98b75158de60c9d8be68a72458889f18ee4abf.png\" data-orig-height=\"726\" data-orig-width=\"895\" srcset=\"https://64.media.tumblr.com/14af21ec637461e4a51b309161abf44d/7d8ebcb29f76f86e-e0/s75x75_c1/5108e246a2132159035c45160966ce9af2f574a9.png 75w, https://64.media.tumblr.com/14af21ec637461e4a51b309161abf44d/7d8ebcb29f76f86e-e0/s100x200/b1bbecff0e48111ee5dc856ec1be604ce88f8001.png 100w, https://64.media.tumblr.com/14af21ec637461e4a51b309161abf44d/7d8ebcb29f76f86e-e0/s250x400/d7fedf5c5ad2a6513b4cfcff7d15f5d643345092.png 250w, https://64.media.tumblr.com/14af21ec637461e4a51b309161abf44d/7d8ebcb29f76f86e-e0/s400x600/05f3eb6e824db6711fd5c73fbfa6212cee14b33e.png 400w, https://64.media.tumblr.com/14af21ec637461e4a51b309161abf44d/7d8ebcb29f76f86e-e0/s500x750/524740f291e7bb452879486891259b247c73d294.png 500w, https://64.media.tumblr.com/14af21ec637461e4a51b309161abf44d/7d8ebcb29f76f86e-e0/s540x810/a264bf58ae3ecc5f11fb2abd83cd096914305828.png 540w, https://64.media.tumblr.com/14af21ec637461e4a51b309161abf44d/7d8ebcb29f76f86e-e0/s640x960/3c98b75158de60c9d8be68a72458889f18ee4abf.png 640w, https://64.media.tumblr.com/14af21ec637461e4a51b309161abf44d/7d8ebcb29f76f86e-e0/s1280x1920/24bc922e788b3a53744e90f8bac310860597026d.png 895w\" sizes=\"(max-width: 895px) 100vw, 895px\"/></figure></div><p>Noita&rsquo;s gimmick is that every pixel is simulated. Fire spreads through anything flammable, electricity travels through metal and liquid, potions can be mixed by dumping them on the ground, the environment can be dug into or even outright deleted. The game started as a physics engine that needed a <i>raison d'etre,</i> and it found a great one. The enemies are designed to take advantage of the engine, offering a variety of attacks that may lead to a chain reaction of exploding barrels, or oil going up in flames. Skilled players can even use these to their advantage: I remember once intentionally making passage for myself by killing an acidic floating enemy at the right spot.</p><p>I stopped to consider why the game is so damn addicting, that why, even after I got constantly screwed (&ldquo;noita&rsquo;d&rdquo;, as the community puts it) I would show up again for more abuse. It wasn&rsquo;t just that I was driven by a completionist streak or even my (very real) gamer pride. I would say the draw is as follows:</p><ul><li>Each run feels novel, yet just static enough that you can learn the game/stage and come back stronger. The perk system may feel &ldquo;RNG&rdquo; or luck-based, but I found that perks you&rsquo;d otherwise like to reroll for may surprise you with their utility. It could very well change the way you approach the rest of the run. Add into this synergies you&rsquo;ll find with your wands and the level itself, it&rsquo;s no wonder people spend just as long in Noita as many do in Skyrim.</li><li>The game dutifully accomplishes what any game should: a grand simulation of the world it&rsquo;s presenting. Synergy and emergent gameplay abound in everyone system the game presents. It is a very gamey game.</li><li>It feels fair. When you fail, even if it was sudden, you&rsquo;ll reason that it was your fault. You weren&rsquo;t careful, or knowledgeable, or skillful enough. And you have learned.</li></ul><p>Noita&rsquo;s biggest strengths are also its biggest weaknesses. Noita&rsquo;s flexibility, emergence, synergy, and other very positive words come at a cost. I nearly quit when I had a fantastic run going, but a Hiisi &ndash; one of few enemies capable of picking up and using wands &ndash; suddenly jumped up at me and simply clicked on me while holding a plasma wand, instantly incinerating me. I don&rsquo;t feel like there was a great lesson to learn there: the player should remain watchful, but not paranoid at all times. Anti-explosion perks are highly valued because one bad explosion can instantly end your run. This means that sometimes the game can be overly stressful, especially when permadeath is a factor. While it&rsquo;s a very fun game, I can&rsquo;t recommend anything but the first two levels as a good way to relax at the end of your day.</p><p>Noita also offers little in the way of meaning; you aren&rsquo;t going to be a better human after playing it. The story exists in far-off corners of the world and while the bosses are unique, it didn&rsquo;t seem there was a lot of value in digging deeper into the lore. I think simply experiencing Noita is enough and there are a bajillion walking simulators you can play if you want something deeper in this regard.</p><p>Ultimately, I finished my time with Noita feeling like those seventy hours were undoubtedly worth it. There are so many wand, spell, and perk combinations available and the systems, the synergy, I cannot stop saying the word: it was beautiful, I&rsquo;d pick up a lightning stone and cast rain over my enemies, frying them. I&rsquo;d take Vampirism and cast a cloud of blood to heal. Because the truth is that while the plasma-beam Hiisi or critical hit energy ball may be OP, you are far stronger.</p>",
    "summary_html": "Noita Review",
    "photos": []
}