{
    "id": "705299379630833664",
    "state": "published",
    "timestamp": 1672625903,
    "date_iso": "2023-01-01T21:18:23-05:00",
    "title": "2022 Annual Review",
    "permalink": "https://vael.tumblr.com/post/705299379630833664/2022-annual-review",
    "tags": [
        "Annual Review"
    ],
    "type": "text",
    "body_html": "<p>(shuffling papers) Pandemic, war, Musk buys Twitter, artificial intelligence&hellip; Humanity has certainly had an eventful year. Now age 34, here’s how 2022 was for me.</p><h2>What went well this year?</h2><p><b>Olivia was born.</b> It’s remarkable that I’m able to have two consecutive annual reviews in which I say a new child was born! She was born completely healthy, with the exception of a congenital knee dislocation. Thankfully, it was a quick fix and she’ll be fine.</p><p>At the time of writing, she’s nearing eight weeks old and meeting her milestones. I want to publicly commend my wife Eve on her flawless dedication to breastfeeding so far.</p><p><b>Raising Violet.</b> Violet continues to surpass her milestones. It’s so incredibly rewarding to watch her develop day by day, learning how to ask for something rather than scream and point at it. I don’t think we go a day without her making us laugh. The “two under two” lifestyle is a big challenge, but I’m able to give her sufficient attention.</p><p><b>Web development.</b> I learned a good amount this year, and I’m happy to announce that as the lead developer at my job, I was finally able to start a new piece of software in Svelte! That means that in the next few months, a Fortune 500 company will be using Svelte in production; albeit for internal usage only.</p><p><b>Game development.</b> I didn’t get all that I wanted done this year, but it was still a good year. I finally migrated Tinydark off Orbium; all games now live under tinydark.com and the Orbium is now known as the Hub. I upgraded the Hub until I was comfortable that it wasn’t an embarrassment. I’m also happy to say it looks like a friend I was mentoring will be able to step in and get some work done on the Hub.</p><p>GAM3 and URPG saw many upgrades. <a href=\"https://tinydark.com/blog/tinydark-2022-review\" target=\"_blank\">Details here.</a> I really enjoyed making content for URPG.</p><p>Oh, and Tinydark is an officially registered company now. :}</p><p><b>Cursing.</b> I’ve managed to keep my language clean around the kids. I’m still internally vulgar; I’ll be coding or gaming and I’ll curse. Will try to improve.</p><h2>What didn’t go so well?</h2><p><b>Lost contact with my mom.</b> No details on this, but she’s made it clear it’s fairly permanent.</p><p>\n\n<b>Focus, cognition, and fatigue.</b> I could honestly write five paragraphs about this, but this was my worst year for cognition yet. I’m having a hard time retaining what I learn and I’m permanently on a “third wind” and desperately need a solid eight hours of sleep for pretty much a year straight. It just can’t happen with our present lifestyle.</p><p>I’m doing way too much stuff for someone in my state, but I just have to take the small wins where I can get them for now. Once Olivia’s sleep regulates, I can start moving toward eight hours of sleep.</p><p><b>I couldn’t release Black Crown: Exhumed.</b> I did release a <a href=\"https://blackcrownexhumed.com/\" target=\"_blank\">teaser website</a> for it. There was too much left to be done, but the game is 99% imported.</p><p><b>Pokemon GO addiction.</b> I still play, but I’m trying to limit myself. PvP is incredibly addicting for my gaming archetype and it’s just too easy to throw in a quick three-minute game here or there. I have to be careful because the rapid tapping required for PvP can end in hand pain.</p><p><b>My body.</b> I kept up with strength training, but I’ve let my cardio and flexibility slide. I’m in pain as I write this because I picked up the baby the wrong way this morning. The pain I’m in is something of a distraction when working.<br/></p><p>The biggest problem is my forward neck posture. I get a headache 4-5 days a week just from the condition my neck (and back) is in and this is a top priority for 2023.</p><h2>What did I learn?</h2><p>I would say I learned to finally accept that I don’t have enough time to do everything I want as quickly as I want to. This is tough for me to cope with, and I think there’s a risk that I’ll unlearn it in the coming years&hellip;<br/></p><p>I spent a lot of time this year studying woke culture. I ramped it up again after my daughter was born; I think I felt similar to how some mothers “nest” before the baby’s born. I want everything to be safe and happy for my children, and it seemed that learning about this serious threat to democracy and quality of life was my way of coping. \n\n<br/></p><p>Finally, I’m deciding to not give people more than I get in return. I’m a good friend, which means I’ll often reach out to people even if they haven’t messaged me in a while. I am no longer in the position to write lengthy emails and check up with people who don’t think about me nearly as much as I think of them.</p><h2>Goals and Expectations: 2023</h2><p>I’ve been developing games with the goal of living off them since 2007. I do not forget this important fact as I press on, building technology, trying to make a “browser game” that’s worthwhile, ethically designed, and that I could make good money with. When I accepted that I just don’t have time to guarantee a 2023 release for URPG, my mind quickly defaulted to Bean Grower. I need to start releasing, I need to start making money; I need to <a href=\"https://www.youtube.com/watch?v=0BeaXmUAUKo\" target=\"_blank\">be a dragon</a>.</p><p><b>Release Bean Grower on the app store. </b>BG’s had a great response and it’s served its intended purpose: a supplemental game for the studio, one that doesn’t need a landing page and isn’t expected to be a game that someone plays every day. Yet experience shows that BG may have more potential than I thought, and I’d like to spend 100-150 hours finishing it off as Version 2 release. This will be a good opportunity to get a game onto the app store, which is a ToDo for Black Crown and URPG.</p><p><b>Release Black Crown: Exhumed in October.</b> Making it for the Steam Halloween Sale is a stretch, but I’m confident I can get it done. </p><p><b>Start building a new house&hellip; or at least find the land.</b> After two new kids, inflation, and stylin’ and profilin’, our bank account’s not full enough for it. But I’m holding an ace: the house we’re in now has appreciated greatly since we built it. Everyone wants to live here. If I can use the equity in the house against the loan, we’ll be able to lay the first bricks this year. We’re stable now, but soon enough, Olivia will be too old to live in the master bedroom with us, and there are sundry things we don’t like about the place we live in now.</p><p><b>Healthy body, healthy mind.</b> If I had my way, I’d spend this year eating as much meat as possible, strength training and cardio 6 days a week, and grinding game dev. Alas, I’m becoming my own bottleneck. I need to stretch daily, jog, take it easy on the caffeine, and see what comes of it.</p><p>For the mind, well. My ADHD is becoming a serious problem. I’m constantly making mistakes outside of the realm of IQ, and it’s affecting everything from my Pokemon win rate to the kids’ diaper changes. Aside from better sleep once it’s logistically possible, I want to get back to “information sponge” Vael. I want to spend time each week on intellectual YouTube and take notes. Some people want to read ten books a year; I want to listen to one <a href=\"https://www.youtube.com/playlist?list=PL22J3VaeABQAbEeT04p5VmAOBmqw2kmxj\" target=\"_blank\">JBP podcast</a> a week. That’s 52 two-hour conversations with very smart people.</p><p>I’m also going to attempt to go back to my Sherlock-inspired habit of looking at my surroundings more and paying more attention in general. This means the phone’s going to stay in the pocket.</p><p>&ndash; &ndash;</p><p>See you next year.<br/><i>Vael</i></p>",
    "summary_html": "2022 Annual Review",
    "photos": []
}