{
    "id": "738349009223221248",
    "state": "published",
    "timestamp": 1704144486,
    "date_iso": "2024-01-01T16:28:06-05:00",
    "title": "Worklust",
    "permalink": "https://vael.tumblr.com/post/738349009223221248/worklust",
    "tags": [
        "jocko willink",
        "work life balance",
        "work",
        "vaelvict.us"
    ],
    "type": "text",
    "body_html": "<p>I like to work. I like to produce results, to progress wherever possible, to optimize and be efficient. If I&rsquo;m driving solo in the car, I&rsquo;m listening to web dev podcasts. If I&rsquo;m working out, it&rsquo;s in front of my computer with dumbbells, watching YouTube. I don&rsquo;t always choose edifying material, but if it&rsquo;s recreational, then it takes up my self-allotted recreation time for the day. Even when gaming, I play optimally: I&rsquo;m reading guides, strategies, and news for anything I&rsquo;m into.</p><p>I write this two weeks into my &ldquo;vaelcation,&rdquo; a six-week period ending January 29th, 2024. In August, I decided to stop dedicating my usual ~5-7 hours of the week working out, and instead dedicate them to game development. This was to ensure <a href=\"https://blackcrownexhumed.com/\" target=\"_blank\"><i>Black Crown: Exhumed</i></a> got finished on time. It didn&rsquo;t, and I wasn&rsquo;t even close. In September, I accepted that I would have to take December off and significantly reduce the <a href=\"https://tinydark.com/\" target=\"_blank\">Tinydark</a> workload that month. I ended up working half into December before deciding to stop and take January off as well. I was burnt out, and that only became more apparent as I developed Black Crown. Despite its impending release, I found myself getting lazy and &ldquo;acting out,&rdquo; as I call it: more easily falling into distraction.</p><p>I&rsquo;m going to talk about my relationship with work. This is a companion post to 2023&rsquo;s Annual Review, so it&rsquo;s meant for me to look back on in the future.</p><h2>You Could Be Doing More</h2><p>When <a href=\"https://jocko.com/\" target=\"_blank\">Jocko Willink</a> was asked, &ldquo;If you could have a gigantic billboard anywhere with anything on it, what would it say and why?&rdquo; His answer was: <b>discipline equals freedom.</b> That&rsquo;s a popular mantra of his, and it&rsquo;s true: if you feel like you don&rsquo;t have enough time, follow a more disciplined time-management schedule. If you&rsquo;re lacking energy, then have the discipline to eat and sleep well, and stick to a workout routine. Our daily lives are composed of decisions that result from our own ability to stay disciplined, or give in.</p><p>If asked the same question, my answer is similar and slightly less adequate: <b>you could be doing more.</b> Most people would assume it means that you could be a better person, kinder and more charitable with your time and resources. That&rsquo;s important, but for me it&rsquo;s a reminder that I can be performing better, and my life will be better for it. This is true for anyone. There&rsquo;s always <i>more</i> or <i>better</i> you could be doing. Most people are capable of far more than they&rsquo;re doing &ndash; and I mean far more. My mantra serves to remind myself that I don&rsquo;t need three or more hours of recreation a day, and to stay focused on what fulfills me.</p><h2>I Did Too Much</h2><p>The most obvious and immediate objection to this mantra is that an adherent may believe they&rsquo;re capable of doing more than they actually are. I&rsquo;d argue this makes a person stronger by pushing their limits. Another objection is that it leads to burnout, a term I&rsquo;ve never wanted to acknowledge might apply to me. To me, burnout signals a lack of passion. It&rsquo;s common for people in software development to lose steam once they realize the undertaking is larger than they expected, or external factors make said undertaking difficult to make time for. I&rsquo;ve never had a problem (at times to my detriment) &ldquo;climbing the mountain,&rdquo; that is, working toward a goal no matter how long it takes, as long as I feel it&rsquo;s worthwhile.</p><p>Both objections would end up applying to me. I&rsquo;m constantly finding myself bemoaning that I don&rsquo;t have enough time, and if I don&rsquo;t get enough time for my own work in the day, I sacrifice recreation time at night. The fact is there&rsquo;s only so much time to complete the day&rsquo;s tasks, and I&rsquo;m not going to sacrifice my dedication to the kids (ages 3 and 1) in order to make more time for my hobby work; not that it&rsquo;d work out well for me if I ignored them, anyway.</p><p>When I admit to burnout, it truly is not due to a lack of passion for Tinydark, but Tinydark is the reason that I don&rsquo;t &ndash; like most people would in my position &ndash; make time to sit and play games at night, and I&rsquo;m more likely to push bedtime when I&rsquo;m working than if I&rsquo;m playing. </p><p>My self-care is abysmal but I&rsquo;m more concerned for the <i>cognitive</i> effects than the mental effects. This year, I&rsquo;ve made more stupid mistakes and felt an efficiency loss from physical fatigue more than ever. I&rsquo;m unhappy that my own father&rsquo;s habits lead to an earlier death than necessary, yet I can&rsquo;t take proper care of myself, just to squeeze out extra hours of work per week. I&rsquo;m very resilient to stress and I don&rsquo;t care if I suffer because I know that when I&rsquo;m done, it will have been worth it, and I know that success itself feels good: just like gaming or watching YouTube, so I might as well keep chuggin&rsquo;.</p><p>I believe AI is going to rock the modern world and by the end of the decade, we&rsquo;re going to see a dramatic ethos shift in the attitude towards work when AI can reasonably complete many &ldquo;knowledge work&rdquo; tasks. I think we&rsquo;re heading toward something worse than the pandemic (whatever it is) and I need to be prepared for higher costs and an eventual lower salary. This gives me only more reason to press on and make money with the studio, further fueling the fire.</p><h2>Elements of Burnout</h2><p>As this is a companion piece to my annual review, I want to detail what my life has been like all year and what the cause of the burnout is.</p><p>Tinydark&rsquo;s ace-in-the-hole has always been my 9-5 job. While I&rsquo;m the lead developer there, traditionally the job has afforded me a fair amount of free time so long as there isn&rsquo;t work to do. Once our tasks from the client are complete, I&rsquo;m free to do whatever I want. While this has sometimes meant I make unnecessarily ambitious projects (Tinydark&rsquo;s Hub), I&rsquo;ve been able to do what I can because rather than slack off, I choose to work on my own software. Our client shifted executives this year, and that caused some new needs to be met by our software, on top of the work we&rsquo;d already scheduled.</p><p>Then, I&rsquo;m a work-from-home dad. Each morning, up until 10 minutes before I&rsquo;m scheduled to go to work, my day is dedicated to (all 3) kids. That&rsquo;s breakfast and play-time. I sign in and begin work at 9. From 9 to 12 I&rsquo;ll be working occasionally stopping to change diapers, manage TV schedules so as not to give them too much screen time, dispense snacks and manage the baby&rsquo;s nap time. Then we all have lunch together and the baby gets a second nap before my wife is able to take over.</p><p>Ever since the third trimester with the baby, my wife&rsquo;s suffered with disordered sleep. This is pretty typical for that stage of pregnancy and the following months (especially breastfeeding moms) but it&rsquo;s been challenging to get a handle on an earlier sleep schedule that would allow her to take over. Since I need my sleep for work the next day, my wife takes the brunt of any night-time needs the kids have, and if the children are sick, it&rsquo;s just hell for her. Still, we&rsquo;re hopeful that 2024 will be easier on us and I&rsquo;m grateful for the help I do receive, such as her cleaning and staging the house for the next day&rsquo;s play.</p><p>Ultimately I&rsquo;m very grateful to be working from home so that I can be with the kids, and that I can have a job where I&rsquo;m allowed the time to take care of them and fit in any of my own dev wherever possible. I don&rsquo;t think there&rsquo;s a lesson to learn from this year, and my vaelcation so far has proven that I will find something work-y to preoccupy myself with even if I&rsquo;m not coding; such as this long post. I still believe we can all be doing more and if there <i>was</i> anything to learn, it&rsquo;s how to manage my expectations better.</p>",
    "summary_html": "Worklust",
    "photos": []
}