{
    "id": "739007983985557504",
    "state": "published",
    "timestamp": 1704772933,
    "date_iso": "2024-01-08T23:02:13-05:00",
    "title": "2023 Annual Review",
    "permalink": "https://vael.tumblr.com/post/739007983985557504/2023-review",
    "tags": [
        "Annual Review"
    ],
    "type": "text",
    "body_html": "<p><i>&ldquo;I might as well copy-paste last year&rsquo;s Annual Review&hellip;&rdquo;</i></p><p>Of course, even last year I thought the same thing. &ldquo;A tiger doesn&rsquo;t change its stripes,&rdquo; and now in my 35th year, it&rsquo;s apparent I won&rsquo;t be changing mine.</p><h2>What went well this year?</h2><p><b>Parenting.</b> I&rsquo;m very aware of the cost of lackluster parenting. &ldquo;It&rsquo;s a terrible thing to do to someone.&rdquo; No matter how strained I am, I&rsquo;ve said I am going to be a dedicated father. This year I dedicated myself to both my girls and continued my usual routine of rallying the boy to greatness.</p><p>When parenting, I track their milestones and development because I want the children to be able to play at (and somewhat over) the level of their peers so that they&rsquo;re able to play with the maximal number of children. Milestones are also easily measured: they can do <i>the thing</i> or not. My son still struggles to relate to his peers today because he&rsquo;s never been on their level, and it&rsquo;s a pitiable thing which I personally experienced as a child. It lead to my poor self-esteem and lack of ambition. When I celebrate milestones, this is why.</p><p><b>Violet.</b> &ldquo;My little storm cloud.&rdquo; 🖤 Violet continues to meet her milestones. She&rsquo;s <i>ahem</i> strong-willed, sweet, intelligent, curious, and funny: I think she&rsquo;s picked up on my ability to parody &ndash; songs and such &ndash; and she&rsquo;ll make up her own little parodies of various things. This year she became a lot less fearful.</p><p><b>Olivia.</b> &ldquo;Child of light.&rdquo; I thought Violet was an especially happy baby; Olivia redefined that for me. For her first year, we called her the <i>colon D</i> <i>baby</i>. This guy -&gt; <small>:D</small></p><p>Olivia is an absolute joy to be around. She took 13 months to walk, which was a surprise given that Violet was fully walking at 10 ½ months, but it looks like she instead allocated her effort towards speech, because this girl can <i>talk.</i> And enunciate! She&rsquo;s also good with her fine motor skills. </p><p>My wife was able to flawlessly breastfeed Olivia for six straight months, which is a big achievement.</p><p><b>Made two new friends.</b> Each from different countries, and each of them web developers. I always love hearing about other cultures and it was because of my Argentinian friend that I&hellip;</p><p><b>Started learning Spanish; soft-quit PGO.</b> This year I finally was able to put down Pokémon GO. Partially because I&rsquo;m playing <i>Pokemon Sleep</i> now, but mostly that I was a little too obsessive about PvP and I felt childish being distracted in public so that I could play the PvE events.</p><p>I started Duolingo mid-November. My learning strategy is slow-paced and with frequent review. I fully achieve &ldquo;legendary&rdquo; on the current unit before moving on to the next. It&rsquo;s working, and it&rsquo;s got to be better for my cognition, and certainly for my life.</p><p><b>Rearranged the house.</b> My wife came up with the plan. My son took my old office and my new office is in the study, previously our entertainment room. I could barely stand living in this house before, but now I&rsquo;m comfortable.</p><p><b>Game development.</b> I may have burned myself doing it, but I can&rsquo;t argue with <a href=\"https://tinydark.com/blog/2023-review-2024-future\" target=\"_blank\">the results</a>. I don&rsquo;t think I&rsquo;ve ever been better poised for a successful year than I am now.</p><p>This year I also received the most volunteer help I ever have. Aforementioned Argentinian friend wrote a robust weather script, and Tinydark&rsquo;s Raigen helped develop tinydark.com and Hub features; I&rsquo;m also excited to announce we&rsquo;ve been able to hire him to work remotely at my workplace. We even had an artist draw some holiday costumes for Tinyblob, our mascot.</p><p><b>Health.</b> I took almost three months off eating &ldquo;optional sugar,&rdquo; breaking my nightly ice cream routine. I&rsquo;d felt like I was starting to get fat, so I simultaneously started focusing more on building my upper body. I went as far as to take before-and-afters for Facebook, but I eventually had to stop so I could focus on game dev.<br/><br/>Though I stopped my upper body work, I <i>did</i> start jogging in the morning. I fell out of the habit once Daylight Saving Time hit, and the girls&rsquo; circadian rhythms were an hour ahead.</p><p><b>Artificial Intelligence.</b> Not exactly &ldquo;my&rdquo; win, but AI has been instrumental in this year&rsquo;s high production. To think it&rsquo;s only gotten better throughout the year and stands to get even better, it&rsquo;s such a privilege to be able to use AI. That&rsquo;s just code; assets have always been a problem for my game development, but AI trivializes some of my asset issues (it&rsquo;s still pretty bad <i>proper</i> asset generation).</p><h2>What didn&rsquo;t go so well?</h2><p><b>Relentless work ethic.</b> I have a long, contemplative post on this <b><a href=\"https://vael.tumblr.com/post/738349009223221248/worklust\" target=\"_blank\">here</a></b>, but: I am too ambitious. &ldquo;A good problem to have.&rdquo; Well, in August I had my first real panic attack at 3AM. I thought it was a heart attack at first. But what&rsquo;s mildly concerning is that I felt stronger for it after; I overcame it on my own and that now that I know what it is, I&rsquo;m better prepared for it. I didn&rsquo;t feel like I should try to avoid this at all, but rather that I&rsquo;m more prepared for a second panic attack. Seems kinda not-a-good mentality.</p><p><b>My body.</b> I said my forward neck posture would be my focus of the year, and I did a passable job of it, but it wasn&rsquo;t enough. I still get headaches and they feel like they&rsquo;re getting worse. We don&rsquo;t have the money nor do I have the bandwidth to see a <a href=\"https://www.rolf.org/rolfing.php\" target=\"_blank\">rolfer</a>, and I&rsquo;m not sure what to do other than try to keep my posture in mind throughout the day. I tried to train myself to sleep without a pillow but had minimal success. I typically lay down once a day, mid-day if work allows it, for about 15 minutes just to clear my head and alleviate some of the pain.</p><p>I also abused caffeine: by my definition, two cups/packets/sessions a day. That likely contributed to the panic attack.</p><p><b>My focus.</b> Nothing new here. It&rsquo;s just hard to truly focus when my morning&rsquo;s waylaid by children and I&rsquo;m needed throughout the day. Interruptions break focus, so that&rsquo;s that: I cannot truly focus. The time I get at night is rarely good for focusing considering it&rsquo;s so scarce, the girls could wake up at any time, and that&rsquo;s typically the bulk of time I get to spend talking with my wife.</p><p><b>Buried.</b> Two-under-two, working my job, working tinydark, doing (it seems) more chores than the typical husband does, my crumbling body and keeping myself healthy are the primary stressors.</p><p>No sympathy allowed; I chose this path and would choose it again.</p><p><b>Finances.</b> We had two kids in two years (I regret not waiting an extra six months) so it&rsquo;s to be expected, but we&rsquo;ve found ourselves deep in the negatives at the end of the year. Inflation&rsquo;s a real killer. We (ie: my wife) made some progress with the decision to grocery shop at two different stores for our weekly shopping trip, but the extra store is Trader Joe&rsquo;s&hellip; full of novel temptations. We&rsquo;re still better off for it, anyway.</p><p><b>Released neither Black Crown: Exhumed nor Bean Grower.</b> I did have to take two weeks off for some contracting, but ultimately I just decided to spend more time on URPG, and <b>everything</b> takes longer than I expect.</p><h2>What did I learn?</h2><p>I feel like this year, I didn&rsquo;t get too worked up about our lack of financial progress. It feels more like acceptance than complacency. I will be free, unburied when my dream is realized: we just need to save up enough money for a down payment on a new house build, then sustain our finances while it&rsquo;s built, and finally sell this house for a minimum of $100k in the bank when all is said and done. I have confirmed this is entirely possible, and I&rsquo;m grateful to have moved South before the pandemic. This is why it&rsquo;s <b>acceptance</b>: achieving this peace of mind is the only way I can finally <a href=\"https://chat.openai.com/share/c67ed0bf-f7fd-41d9-b763-7740d0d63ff9\" target=\"_blank\">buy the ice cream</a>.</p><p>Otherwise, I&rsquo;ve meditated on it, and honestly: I don&rsquo;t know that I really learned anything notable. At least as far as wisdom vs. tangible knowledge.</p><h2>Goals and Expectations: 2024</h2><p><b>Game dev.</b> I can at least guarantee Bean Grower&rsquo;s getting a final release, presumably onto an app store. I&rsquo;m giving myself three damn months for it. Black Crown is <i>also</i> getting three damn months, but I will concede that Steam Store support might be a stretch goal. Either way, I&rsquo;m ending this year with two full titles under my belt.</p><p><b>Financial recovery.</b> Sort of a given, and who knows, maybe the 15,000 hours I&rsquo;ve spent building a game studio will actually pan out this year.</p><p>&ndash; &ndash;</p><p>Welp, figger that&rsquo;s it.<br/><i>Vael</i></p>",
    "summary_html": "2023 Annual Review",
    "photos": []
}