{
    "id": "760524572602810369",
    "state": "published",
    "timestamp": 1725292751,
    "date_iso": "2024-09-02T11:59:11-04:00",
    "title": "Remembering My Grandparents",
    "permalink": "https://vael.tumblr.com/post/760524572602810369/my-grandparents-and-legacy",
    "tags": [
        "vaelvict.us"
    ],
    "type": "text",
    "body_html": "<p><b>Remembering</b></p><p>In early August, my grandfather (95) and grandmother (87) died on the same day: he, cancer, and she, cerebrovascular disease. I called him Nonno (Non for short, Italian for Grandfather), and she was simply Gram. My mother would instead take up the French Mémé for my children.</p><p>My grandparents were very present in my life from childhood to adolescence. I have many memories of them, and I&rsquo;ll share a few to help color who they were, at least to me. They&rsquo;d pick up me, my sister and my cousin from school and we&rsquo;d spend the evening there, eating supper and then leaving for home. My cousin and I would spend time on the computer and occasionally watching TV.</p><p>I remember Non looking over my messy room when I was ~8 years old. I gestured over the scene I&rsquo;d made, telling him, &ldquo;This is the city!&rdquo; and he mirthfully replied, &ldquo;No, this is the city dump!&rdquo; I remember working on the bathroom sink with him and needing to remove some grime from the pipe. I didn&rsquo;t want to do it because it was yucky and he said, &ldquo;Ah don&rsquo;t be a baby!&rdquo; and reached in and just removed it with his fingers. He&rsquo;d take me to and from community college in my loser days; indulge in fun snacks, ask if we wanted more. He liked to stay busy and while I don&rsquo;t know the details, I understand retiring wasn&rsquo;t easy for him.</p><p>Gram was cheerful and I have only one memory of ever being scolded. She took me to the chess club at the library and eventually to a chess tournament that I lost fairly rapidly. She practiced massage therapy and had worked on me a few times. The computer at her house was hers and she had decent computer literacy for a while. I want to say I sent her an email once but I cannot remember. When she was a girl, she&rsquo;d walk with her classmates past a hospital (or medical building) and point to it saying she wanted to work there when she grows up. She became a registered nurse and did just that; this has always stuck with me.</p><p>I will regret not making it to their funeral. I moved away from Rhode Island and all family in February 2019, down to South Carolina to start the next phase of my life. I thought we&rsquo;d visit more, but at that time, I didn&rsquo;t know we wanted more kids. Circumstances have kept me rooted here, missing my sister&rsquo;s wedding and now my grandparents&rsquo; funeral. I didn&rsquo;t feel guilty, because it was unavoidable, but I still felt bad about it. I have a picture of them in a frame on my shelf. Mmm. What I should feel guilty for is not calling them since 2021. I could never bring myself to do it for some reason. I think there is some psychological effect of isolation and not seeing people for so long that contributed to my inability to do so. Still I will accept it as my own shittiness.</p><p><b>Legacy</b></p><p>A person is shaped by the sum of their life experiences and <a href=\"https://en.wikipedia.org/wiki/Biological_determinism\" target=\"_blank\">biological heritage</a>. Our ancestors, therefore, transcend time; they live on within us. As I became a fully actualized adult, I started to draw parallels and be conscious of similar traits &ndash; both good and bad &ndash; that I had inherited from experience and biology. It&rsquo;s surprising how much I attribute to my grandfather. I&rsquo;m grateful to have inherited his and my father&rsquo;s ambition and work ethic, even if it <a href=\"https://vael.tumblr.com/post/738349009223221248/worklust\" target=\"_blank\">sorta drives me crazy</a>. I don&rsquo;t imagine that I am directly continuing his legacy, but I am a reverberation. I am grateful for him and for the life I have because of my grandparents.</p><div class=\"npf_row\"><figure class=\"tmblr-full\" data-orig-height=\"167\" data-orig-width=\"301\"><img src=\"https://64.media.tumblr.com/f862aa57bbfa11217f2c35063493f271/7e4c48bd98ff9803-b0/s640x960/898893e7b769d847b5b175a6471b9855ca415a4c.png\" data-orig-height=\"167\" data-orig-width=\"301\" srcset=\"https://64.media.tumblr.com/f862aa57bbfa11217f2c35063493f271/7e4c48bd98ff9803-b0/s75x75_c1/ab1f692ffe5f8b2d6b82a11279c00617c19efad8.png 75w, https://64.media.tumblr.com/f862aa57bbfa11217f2c35063493f271/7e4c48bd98ff9803-b0/s100x200/fdf21e353810b4b89a91bd6eb17ab1c006544ea2.png 100w, https://64.media.tumblr.com/f862aa57bbfa11217f2c35063493f271/7e4c48bd98ff9803-b0/s250x400/7c263ae92003c60c5c3dd8cab8bded18b5d178b7.png 250w, https://64.media.tumblr.com/f862aa57bbfa11217f2c35063493f271/7e4c48bd98ff9803-b0/s400x600/d6c6ae62b05f11786eaacf62c4118010b9fab248.png 301w\" sizes=\"(max-width: 301px) 100vw, 301px\"/></figure></div><p>Pictured is a decorative sign with the words, &ldquo;all because two people fell in love.&rdquo; It hangs on a wall in my grandparents&rsquo; house, accompanied by many pictures of the family. Since their deaths, I have been thinking more than I usually do &ndash; already a fair amount &ndash; about ancestry and legacy. Their decision to have five children lead to seven grandchildren and (currently) four great grandchildren. It was a necessary sacrifice they made, and it&rsquo;s a sacrifice that many otherwise capable couples are opting out of in 2024. I cannot even comprehend the ripples that were made already, and certainly not what will be made, from their decision to have five kids. I wish I could have more. The love I feel from raising my children every day is something no one should opt out of.</p><p>I&rsquo;ve decided that when the time comes, I will be &lsquo;Nonno&rsquo; to my grandchildren. I do not have such a short memory that I should feel guilty about this because of how little communication I had with my grandparents in their final years. I was very satisfied with my grandparent experience and I will seek to be as great a grand-dad as him (or even better, as we all desire). I will continue making my ancestors&rsquo; sacrifice worth it, and so shall, in time, achieve transcendence of my own.</p>",
    "summary_html": "Remembering My Grandparents",
    "photos": []
}