{
    "id": "772227692666961920",
    "state": "published",
    "timestamp": 1736453716,
    "date_iso": "2025-01-09T15:15:16-05:00",
    "title": "2024 Annual Review",
    "permalink": "https://vael.tumblr.com/post/772227692666961920/2024-annual-review",
    "tags": [
        "annual review"
    ],
    "type": "text",
    "body_html": "<p>My 36th year on Earth, as always, did not go as expected. I learned in September that<b> we are</b> <b>with child</b>. My son is due mid-May. He was a <i>surprise</i> for us. :}</p><p>I lived the same lifestyle that I did in 2023: I wake up, get both girls ready (now 2, Olivia and freshly 4, Violet), eat breakfast, play for around 30 minutes, then sit down at my computer to work remotely. They get TV while I start my work day and then they do whatever for a while. Olivia was great about taking her first nap until around her second birthday. I make us lunch. My wife wakes up in the afternoon. I get both girls to bed.</p><p>The time my wife wakes varies depending on how severe her insomnia was that night, whether or not the kids needed her overnight, and/or if she especially suffered from pregnancy symptoms. She has trouble with insomnia and her other cocktail of diagnoses that keep her from being around in the morning. She takes care of the children overnight if they stir. I should disclaim that she is not lazy or depressed but rather just unhealthy, and every time she tries to course-correct, things get in the way. Further disclaimer that anyone who knows me knows that I would not marry nor love a lazy wastrel, so please understand this lifestyle is an inevitable struggle for all of us.</p><h1><b>What went well this year?</b></h1><h2><b>Parenting</b></h2><p>&ldquo;Some people are worth melting for.&rdquo; &ndash; Olaf, <i>Frozen</i></p><p>Raising my two girls has been incredibly fulfilling and rewarding. They bring me such joy every day. It&rsquo;s hard for me, at least succinctly, to articulate quite how good it is. I suspect this is the case for many enthusiastic parents. The banter between all three children, their mispronunciations of words, surprising me with newly learned words, it&rsquo;s all just great.</p><p><b>Violet.</b> Fully potty trained (diaper at night) and meeting all milestones. Violet is sweet, quirky, loves her family, and just being a girl.</p><p>This year I totally accepted and confirmed that my little girl is higher on the neuroticism scale than most children. This means she&rsquo;s more sensitive to negative emotion. This is worrying because it will affect her ability to be resilient, which is critical on the path to greatness, but as long as we&rsquo;re aware of it, we may be able to turn her neuroticism into a positive.</p><p><b>Olivia.</b> Truly all is good with Olivia. ♥ I&rsquo;m not exaggerating when I say I&rsquo;m having full conversations with her. She&rsquo;s sharp as hell, well-mannered, loves cuddles, loves Miss Rachel, she&rsquo;s really just an outstanding toddler that we&rsquo;re privileged to be raising.</p><p><b>Baby&hellip;?</b> Well, I&rsquo;m really happy to have a son who I can imbue all my masculine ambition into. I&rsquo;m not happy that he&rsquo;ll likely end up as short as me &ndash; 5'3 is a real struggle for dating, but I got lucky &ndash; but in life, attitude and ability are more important than stature. <i>So far so good</i> on his health, and he&rsquo;s <i>very</i> active in my wife&rsquo;s tummy. :}</p><h2><b>Work</b></h2><p><b>Game development.</b> So much was done this year that I can&rsquo;t even believe we did it. It&rsquo;s surreal. When Raigen joined work on the engine in March, it revolutionized everything for me. He&rsquo;s taken on something like 150-200 tasks and many of them were things I simply couldn&rsquo;t have justified doing for years, such as accessibility (a11y).</p><p>So surely I released a title? No. Black Crown:</p><blockquote class=\"npf_indented\"><p>The game is fully imported and playable, and some work has been done to make it present better. I missed the Halloween release by a large margin due to Hurricane Helene and a still-faulty import, but it likely wouldn&rsquo;t have been in such a good place that I would have been comfortable releasing anyway. What remains for gameplay is converting Failbetter&rsquo;s &ldquo;Living Story&rdquo; mechanics to GAM3&rsquo;s instance-based quality management and some playtesting to make sure every story path functions properly.</p></blockquote><p>Bean Grower:</p><p>Development was to be in two phases: the necessary technical side, then gameplay improvements which would lead to a V2. I could only justify time spent on the technical improvements, and I&rsquo;m sorry to say it&rsquo;s unlikely that Bean Grower will see a V2 this decade.</p><p>Engine licensing. Made my first contract, spun up a new server, and licensed the engine out for someone to start making their own game! Starting at $25/mo. Even if this first contract doesn&rsquo;t work out, I have confidence that I can get a few licensees under me by mid-2026. Once I&rsquo;m making a few hundred a month, I can start to invest that back into Tinydark and do some proper marketing. The plan is still to bring in most of my income through <i>actual games</i>.</p><p><b>My workplace.</b> Remains stable, and we started Version 3 of our software this year, guaranteeing another few years of stability at the company. We brought on a new guy to help and things are just dandy. The boss did worry that I wasn&rsquo;t going to be able to commit the hours needed for the project, given &ldquo;Daddy Daycare&rdquo; as we call it, but I proved myself.</p><h2><b>Other</b></h2><p><b>Made a new friend.</b> Nice guy. He also sponsored Tinydark&rsquo;s new server for 15 months. <br/><br/>Separately, something I consider positive is that I distanced myself from another, one-sided relationship but am still friendly with the person.</p><p><b>Spanish</b>. In-line with expectations. Found it hard to show up at times; truth is I don&rsquo;t really need the extra burden in my life but I must reignite my cognition wherever possible.</p><p><b>We got three new cats.</b> For a total of six. Objectively a mistake, but one thing lead to another, and here we are.</p><h1><b>What didn&rsquo;t go so well?</b></h1><p><b>Sleep.</b> A mix of self-discipline and the reality of raising small children, but it&rsquo;s largely my own fault. It&rsquo;s a recurring theme: I&rsquo;ll say I have (eg.) 150 minutes before bed, and I can fit in [x] and [y] minutes of recreation time to be in bed no later than 11:15. Then I inevitably fail discipline, or ADHD myself out of those minutes and I&rsquo;m left with something like 120 minutes of actionable time. Even if I&rsquo;m doing well, I&rsquo;ll often just continue working &ldquo;because I have only have 15 minutes for games.&rdquo;</p><p>Well, it is my own failure and I will try to get better this year. I&rsquo;m really not more productive for it. I&rsquo;m thriving only when caffeinated, and it&rsquo;s pathetic. I need more sleep and I think I&rsquo;ll just have to forget the gaming meme because the truth is that sleep is stress relief.</p><p><b>Caffeine.</b> My only vice. The abuse, and dependence, worsened this year. I&rsquo;m often &ldquo;double caffeinating,&rdquo; but it&rsquo;s hard to gauge how much caffeine I&rsquo;m consuming given it&rsquo;s all instant coffee mix. One win is this <a href=\"https://bettercuppa.com/products/mushroom-coffee\" target=\"_blank\">mushroom coffee</a>, which lights my neurons up like no other with less caffeine than a typical cup of coffee.</p><p><b>My body.</b> Forward neck posture is still a problem. I did see a(n expensive) physical therapist to help determine how messed up I am, and the verdict was: not very. So that was nice, but I&rsquo;m forgetful or even lazy about the exercises sometimes.</p><p>I end the year just as physically fit as I did the last; I sacrifice workout time in order to make progress in game development. Typically if I have a protein-heavy day, I&rsquo;ll try to at least lift dumbbells.</p><p><b>My focus.</b> Can only have worsened. There isn&rsquo;t a lot to do here; exhaustion exacerbates ADHD symptoms and I cannot use my desired Forest (focus app) solution with kids running around or people needing me. I context switch constantly.</p><p><b>Hurricane Helene.</b> We lost power for 7½ days, and all the dining out + food replacement + emergency supplies totaled somewhere around $1,500. Thankfully we had a family friend send us some money to help or we&rsquo;d be even deeper in the financial hole&hellip;</p><p><b>Finances.</b> We&rsquo;re pretty deep in debt and we haven&rsquo;t even had to pay much for the baby yet. I thought we&rsquo;d see some progress due to switching primarily to Costco for our grocery needs, and it really was a boon, but it wasn&rsquo;t enough. Kids, lifestyle inflation, inflation; it&rsquo;s all too much, and my brilliant idea of taking out a loan to pay our credit card debt wasn&rsquo;t very effective. With a new baby and a necessary new car on the way, it ain&rsquo;t lookin&rsquo; pretty.</p><p><b>My son.</b> A few years ago I just stopped mentioning my son Abel because I had nothing good to report. Our relationship, his role in the family, and he as a whole, have only gotten worse. We need him now the most, and he has now gotten to the point where he sometimes won&rsquo;t join us for dinner. I allow it because I&rsquo;m tired of chasing him to participate with us. It&rsquo;s completely averse to the family focus we have, and we&rsquo;ve talked, done so much, and there seems to be nothing we can do but wait and see who he becomes. Where I am excited for my other children&rsquo;s&rsquo; future, I am worried for his.</p><h1><b>What did I learn?</b></h1><p><b>Wisdom.</b> This year, I listened to more <a href=\"https://www.youtube.com/channel/UCsoiSpBvkr4Y-78Pj3recUw\" target=\"_blank\">Meaningwave</a> than I ever have. I also listened to a greater variety of it. It might sound weird that just listening to music improves you as a person, but Meaningwave is a genre of music that samples or speaks the words of the greatest thinkers in human history. Marcus Aurelius, Jordan Peterson, Jocko Willink, David Goggins, and Naval Ravikant are my favorite speakers.</p><p>If you do check it out, most people&rsquo;s complaint is that it&rsquo;s repetitive: yes, sort of the point, and it&rsquo;s mostly Akira&rsquo;s older work that suffers from excessive repetition.</p><p><b>Business</b>. Especially in Q4 of 2024 I really got into studying business and entrepreneurship, largely due to my exposure to Naval Ravikant through Meaningwave. Naval has an amazing compilation of his podcast episodes <a href=\"https://www.youtube.com/watch?v=1-TZqOsVCNM\" target=\"_blank\">here</a> that essentially constitute a business course. I&rsquo;ve listened to it twice and it gives me hope that I&rsquo;m on the right path. It&rsquo;s been a long time without making profit, and I have my reasons that I can defend, but the fact is it&rsquo;s been a <i>long</i> time.</p><p><b>Personal growth.</b> I feel great about myself because I&rsquo;m doing everything I set out to do. I&rsquo;m actively trying to &ldquo;give people energy,&rdquo; understand what&rsquo;s ailing people, being a great man and father, absorbing the aforementioned wisdom and reflecting on it. I feel like when I see people failing and making excuses, or just struggling in avoidable ways, I have a framework to recognize the problem and offer solutions in the same way I&rsquo;d solve a technical problem with code.</p><p>This all said, I&rsquo;m growing impatient with weak people. I&rsquo;m tired of sensitivity, excuse making, tribalism, self-centeredness. So many problems people face stem from just not trying hard enough, not being lifelong learners, or being closeminded. People have noticed I&rsquo;m a bit <i>strong</i> when speaking lately; maybe it&rsquo;s a temporary thing, but I&rsquo;m actively trying to not sugarcoat my thoughts nor be especially politically correct.</p><h1><b>Goals and Expectations: 2025</b></h1><p><b>Game dev.</b> Releasing Black Crown is my only expectation this year, beyond more open-world support for GAM3. I don&rsquo;t see myself writing documentation for external developers until 2026 and I&rsquo;m not sure how much attention Black Crown&rsquo;s release will garner. I think it&rsquo;s more than likely that I will at least begin the process of releasing Black Crown to mobile app stores.</p><p><b>Financial recovery.</b> I think we&rsquo;ll get close to being out of debt this year. Perhaps Black Crown&rsquo;s a big hit or I&rsquo;ll finally get some work from my agency.</p><p><b>Web development.</b> We&rsquo;re in a weird place: the job market is shrinking, along with our salaries, and AI is making it hard for good candidates to stand out. But web tech in general is just fantastic and only getting better, and AI makes us much more productive than we previously were. If I were to &ldquo;read the writing on the wall,&rdquo; it would seem clear that this is the best time for ambitious individuals to work on their side hustles. Good for me, though the games industry isn&rsquo;t in a great spot either.</p><p><b>DOOM.</b> I still believe &ldquo;something&rdquo; is coming for the modern world. Whether that&rsquo;s the effects of depopulation, another pandemic, AI replacing knowledge workers, who knows. Will Tarriff Trump solve anything? Who knows. Will DOOM arrive this year or in five? Who knows. Best to just be prepared.</p><p>And so wraps up my longest annual review to date.<br/><i>Vael Victus</i></p>",
    "summary_html": "2024 Annual Review",
    "photos": []
}